{
  "2022-02-04_USCOURTS-nyeb-1_17-ap-01005_Golden v. Firstmark Services LLC et al.pdf": [
    [
      4.8925065994262695,
      3.7869484424591064,
      0.31417983770370483
    ],
    "In the adversary proceeding Tashanna B. Golden v. Firstmark Services LLC et al., the United States Bankruptcy Court for the Eastern District of New York dealt with a motion to strike the expert report of Mark Kantrowitz, submitted by the plaintiff, Tashanna Golden. The defendants contended that Kantrowitz's report improperly included legal opinions regarding the dischargeability of student loans under bankruptcy law, which infringed upon the court's role. The court granted the motion in part, excluding Kantrowitz's legal conclusions, but allowed portions of the report that offered expert opinion based on his experience and industry knowledge. Ultimately, the court emphasized its role in determining legal interpretations while considering relevant expert testimonies."
  ],
  "2025-05-09_USCOURTS-cod-1_22-cv-01129_Coomer v. Lindell et al.pdf": [
    [
      5.031809329986572,
      3.610142230987549,
      -0.0273904986679554
    ],
    "In the case Coomer v. Lindell et al., Plaintiff Eric Coomer sued Defendants Michael J. Lindell, Frankspeech LLC, and My Pillow, Inc. for defamation, intentional infliction of emotional distress, and civil conspiracy, claiming they falsely stated he was involved in election interference during the 2020 presidential election. Coomer sought to exclude various pieces of evidence at trial, including personal matters like his motor vehicle accident, drug use, and opinions about law enforcement, resulting in a mixed ruling from the court on what evidence could be admitted. Notably, the court denied Defendants' attempt to introduce a corrected response document, which had issues related to citations generated by artificial intelligence, exemplifying AI's role in the legal proceedings."
  ],
  "2025-07-01_USCOURTS-cand-4_24-cv-09519_Rogers v. United States Postal Office et al.pdf": [
    [
      5.181601047515869,
      4.005041122436523,
      -1.0760105848312378
    ],
    "In the case of Jurgen Rogers v. United States Postal Service, plaintiff Rogers filed claims under the Federal Tort Claims Act (FTCA) alleging harassment and improper mail delivery by his mailman. The court granted the defendants' motion to dismiss due to Rogers' failure to adequately plead exhaustion of administrative remedies required for FTCA claims, indicating that he had not established he filed a formal complaint with the USPS regarding his issues. Additionally, the court raised concerns about inaccuracies in the plaintiff's legal citations and directed his counsel to show cause why sanctions should not be imposed for these errors."
  ],
  "2025-07-07_USCOURTS-laed-2_24-cv-02290_Tijerino v. Spotify USA Inc.pdf": [
    [
      5.367117404937744,
      3.5779881477355957,
      0.06814071536064148
    ],
    "In the case of Tijerino v. Spotify USA Inc., Plaintiff Manuel Tijerino filed a motion to compel discovery and to deem requests for admission as admitted, claiming that Spotify’s responses included boilerplate objections and inadequacies. The court, however, denied Tijerino's motions without prejudice, citing his failure to properly confer with Spotify in good faith and not adequately identifying the specific discovery disputes. Notably, during a crucial conference, Tijerino used an artificial intelligence program to formulate his responses, which led to misunderstandings and ultimately did not meet procedural requirements."
  ],
  "2025-06-23_USCOURTS-ksd-2_25-cv-02145_Miller v. Kansas Department of Children and Families et al.pdf": [
    [
      5.101646900177002,
      3.8242440223693848,
      -0.790845513343811
    ],
    "Meghann R. Miller filed a lawsuit against the Kansas Department of Children and Families and other individuals involved in a child custody dispute, alleging civil rights violations under 42 U.S.C. §§ 1983, 1985, and 1986, as well as violations related to the Americans with Disabilities Act. The dispute arose after a court order prohibited her from contacting her five children based on unsubstantiated abuse allegations. Miller's motion for a temporary restraining order and preliminary injunction, aimed at overturning a DCF finding that allegedly relied on fabricated evidence regarding emotional harm due to her social media activity, was denied by the court, which found that she had not demonstrated exceptional circumstances warranting an ex parte order. The case also involved a selective AI certification requirement imposed by the judge, which Miller claims obstructed her access to justice."
  ],
  "2025-07-07_USCOURTS-ca7-24-02352_Ruben Santoyo v. City of Chicago_ et al.pdf": [
    [
      5.272304534912109,
      3.56599760055542,
      -0.43606966733932495
    ],
    "Ruben Santoyo appealed the denial of two post-judgment motions to reinstate his lawsuit against the City of Chicago and two police officers who arrested him for battery. The Seventh Circuit affirmed the lower court's decision, ruling that Santoyo's motions were frivolous and lacking evidence, particularly criticizing his vague allegations of judicial misconduct and his inappropriate citation of non-existent cases generated by an artificial intelligence program. The court warned that further frivolous appeals could result in sanctions."
  ],
  "2025-06-20_USCOURTS-kywd-3_24-cv-00375_Buckner v. Hilton Worldwide Holdings_ Inc..pdf": [
    [
      5.262179851531982,
      3.6399693489074707,
      0.09507638216018677
    ],
    "The case Buckner v. Hilton Worldwide Holdings Inc. involves pro se plaintiff Michael Buckner, who moved for the recusal of the presiding judge, citing potential conflicts of interest due to the judge's spouse's ties to a lobbying firm representing major corporations, including Microsoft. Buckner's claims stem from his termination at Tata Consultancy Services, including allegations of defamation and wrongful termination against Hilton and other parties. The court denied the motion for recusal, determining that the alleged connections did not present a reasonable question of the judge's impartiality. Additionally, Buckner faced criticism for citing non-existent case law in his filings, raising concerns about the use of artificial intelligence in creating legal documents, which was deemed a violation of his duty of candor to the court."
  ],
  "2025-07-07_USCOURTS-cod-1_22-cv-01129_Coomer v. Lindell et al.pdf": [
    [
      5.496033191680908,
      3.2930290699005127,
      0.16568084061145782
    ],
    "In the case of Coomer v. Lindell, the court addressed serious deficiencies in the Defendants' Opposition to a Motion in Limine, including nearly thirty erroneous citations to nonexistent cases and misrepresentations of legal principles. The defense counsel admitted to using generative AI tools in preparing their filings but failed to properly verify the accuracy of the citations. Consequently, the court sanctioned the lead attorney and their law firm for violating Rule 11 of the Federal Rules of Civil Procedure, imposing a monetary penalty of $3,000 on both the attorney and their associate due to their lack of due diligence and accountability in the submission."
  ],
  "2025-05-30_USCOURTS-txwd-5_24-cv-00799_Woodmen of the World Life Insurance Society v. Hale et al.pdf": [
    [
      5.039630889892578,
      4.3355841636657715,
      0.004420742858201265
    ],
    "In the case Woodmen of the World Life Insurance Society v. Hale et al., the United States District Court for the Western District of Texas presided over a statutory interpleader action concerning competing claims to $25,000 from a life insurance policy. The court granted summary judgment in favor of Margaret S. Wood, the alternate beneficiary, because the primary beneficiary, Owen McDonald, predeceased the insured, Anna McDonald, and therefore his interest never vested. Russell McDonald and Brenda Hale, both claiming under the 'per stirpes' language, were denied any recovery as their claims relied on an interest that did not exist. The court also noted that while pro se parties attempted to use AI for legal research, it led to incorrect arguments by Russell and Brenda, whereas Margaret used AI more effectively, though still resulting in cited sources that could not support her conclusions."
  ],
  "2025-06-11_USCOURTS-flsd-0_25-cv-61018_Huntington Bank v. M_Y Something About Meri et al.pdf": [
    [
      5.311954498291016,
      3.8088579177856445,
      -0.2590712010860443
    ],
    "The case Huntington National Bank v. M/Y Something About Meri involves a dispute over the repossession of a yacht owned by Stanley R. Kalish, who is in breach of a loan agreement with the bank. The bank seeks a warrant to arrest the vessel and appoint a substitute custodian, while Kalish has filed multiple motions alleging wrongdoing by the bank and seeking sanctions. A significant issue arose from allegations that a non-party involved in the case, Danielle Morron, used artificial intelligence to draft numerous filings, raising concerns about the legitimacy of the pleadings and the unauthorized practice of law. Ultimately, the court recommended granting the bank's motion for a warrant while denying Kalish’s motions without prejudice."
  ],
  "2025-06-20_USCOURTS-ctd-3_25-cv-00640_Reilly v. Connecticut Interlocal Risk Management Agency et al.pdf": [
    [
      5.321329116821289,
      3.4506115913391113,
      -1.3351874351501465
    ],
    "In the case of Reilly v. Connecticut Interlocal Risk Management Agency, the United States District Court for the District of Connecticut dismissed Christopher B. Reilly's lawsuit under 28 U.S.C. § 1915 for failing to state a viable claim. The court recognized concerns about Reilly's four claims, which included procedural due process and mail fraud, none of which appeared to have a legal basis. During the dismissal process, the court noted discrepancies in Reilly's filings, suggesting the potential use of artificial intelligence in his submissions, which may have led to inaccuracies in legal citations and representations."
  ],
  "2024-05-06_USCOURTS-nynd-5_24-cv-00438_Ball v. Criminal Investigations Department et al.pdf": [
    [
      4.974395275115967,
      3.5621159076690674,
      -1.6876184940338135
    ],
    "In the case of Ball v. Criminal Investigations Department et al., plaintiff Denyall Ball filed a civil rights complaint alleging violations under 42 U.S.C. § 1983, claiming victims of remote neural monitoring which involved invasive monitoring and manipulation of her thoughts and emotions. The court recommended dismissal of the complaint based on its frivolous nature and the inability of Ball to establish a claim with merit, noting that her allegations seemed irrational and delusional."
  ],
  "2022-07-19_USCOURTS-dcd-1_18-cv-02065_ZAMBON et al v. ISLAMIC REPUBLIC OF IRAN_ MINISTRY OF FOREIGN AFFAIRS.pdf": [
    [
      3.6209912300109863,
      3.373182773590088,
      -0.8356093764305115
    ],
    "In the case of Zambon et al v. Islamic Republic of Iran, the United States District Court for the District of Columbia found Iran liable for providing material support to a terrorist syndicate, including the Taliban and al-Qaeda, which perpetrated several attacks against U.S. servicemembers in Afghanistan from 2006 to 2019. The court determined that Iran's actions constituted a violation of the terrorism exception to the Foreign Sovereign Immunities Act (FSIA), leading to compensatory damages for the plaintiffs, who included injured servicemembers and family members of deceased victims. The judgment focused on specific bellwether attacks, establishing the significant connection between Iran’s support and the harm caused to U.S. citizens."
  ],
  "2022-07-19_USCOURTS-dcd-1_19-cv-03835_CABRERA et al v. ISLAMIC REPUBLIC OF IRAN.pdf": [
    [
      3.63362717628479,
      3.3741579055786133,
      -0.8256275057792664
    ],
    "The case involves a group of plaintiffs, including U.S. servicemembers and their families, suing the Islamic Republic of Iran under the terrorism exception of the Foreign Sovereign Immunities Act (FSIA). They allege that Iran provided material support to a terrorist syndicate, including the Taliban and al-Qaeda, responsible for various attacks against Americans in Afghanistan from 2006 to 2019. The court found Iran liable for several bellwether attacks, awarded compensatory damages to the plaintiffs, and directed the claims of additional plaintiffs to be referred to a Special Master for further proceedings."
  ],
  "2025-04-23_USCOURTS-cod-1_22-cv-01129_Coomer v. Lindell et al.pdf": [
    [
      5.392639636993408,
      3.3249332904815674,
      0.08597523719072342
    ],
    "In the case of Eric Coomer v. Michael J. Lindell et al., the United States District Court for the District of Colorado addressed serious deficiencies in the legal opposition filed by the defendants, including multiple inaccuracies in legal citations and misrepresentations of case law. The lead counsel for the defendants, Christopher I. Kachouroff, admitted to using generative artificial intelligence (AI) to draft the opposition, leading to significant errors. The court ordered defendants' counsel to show cause why they should not face sanctions or disciplinary proceedings for their professional conduct, particularly regarding the use of AI without adequate citation verification."
  ],
  "2023-04-19_USCOURTS-pamd-4_19-cr-00207_USA v. Bressi et al.pdf": [
    [
      4.828961372375488,
      3.3378043174743652,
      -0.34542518854141235
    ],
    "The case, USA v. Bressi et al., involved a multi-year investigation into a drug distribution conspiracy. Defendants Anthony Bressi, Damonico Henderson, and Terry Harris were indicted based on extensive evidence including surveillance, bank records, confessions, and controlled buy operations. All three defendants filed multiple pretrial motions to suppress evidence and sever their trials, arguing constitutional violations; however, the court denied all motions, asserting that there were no constitutional infirmities and allowing for a joint trial given the evidence presented."
  ],
  "2024-04-15_USCOURTS-flsd-1_22-cv-23745_Taveras v. Florida Department of Transportation et al.pdf": [
    [
      5.138468265533447,
      3.713118076324463,
      -0.875966489315033
    ],
    "In the case of Taveras v. Florida Department of Transportation, pro se plaintiff Eliezer Taveras filed a civil rights action against multiple defendants, including the Florida Department of Transportation and a towing company, alleging violations of 42 U.S.C. § 1983 and the Fair Debt Collection Practices Act due to improper vehicle towing and collection practices. The court recommended dismissing all claims without prejudice, allowing Taveras one final chance to amend his complaint, due to insufficient allegations of state action and standing, among other legal deficiencies. The mention of artificial intelligence arose as the defendants questioned whether Taveras had used AI to draft his legal filings, suggesting inconsistencies in legal references and writing style."
  ],
  "2025-01-07_USCOURTS-mad-4_22-cr-40001_USA v. Charrette.pdf": [
    [
      4.948779582977295,
      3.034341335296631,
      -1.2050220966339111
    ],
    "In the case of USA v. Edmond Charrette, the government sought an order to involuntarily administer antipsychotic medication to restore the defendant's competency to stand trial for charges of arson. However, the court denied this request, finding that the government did not meet the stringent criteria established in Sell v. United States, which requires clear evidence of the necessity for involuntary medication to protect significant governmental interests. The court concluded that there were too many unanswered questions regarding the defendant’s mental condition and likelihood of responding to treatment, and emphasized the substantial likelihood of civil commitment rendering prosecution unnecessary."
  ],
  "2021-10-12_USCOURTS-nynd-1_21-cv-00965_Carson_ Jr. v. Google Hackers et al.pdf": [
    [
      5.152737617492676,
      3.5490431785583496,
      -1.311438798904419
    ],
    "In the case of Thomas Carson, Jr. v. Google Hackers and CIA Handler, the plaintiff filed a pro se complaint alleging that hackers had infiltrated his email and stolen personal information, claiming he was a victim of government experiments and torture. The court granted Carson's application to proceed in forma pauperis but found the complaint too convoluted and unclear to meet the pleading standards of the Federal Rules of Civil Procedure. The court recommended dismissal of the complaint with leave to amend, giving Carson one opportunity to clarify his claims. Carson's request for appointed counsel was denied as premature."
  ],
  "2006-07-06_USCOURTS-nynd-5_00-cv-01500_Casolare v. County of Onondaga_ et al.pdf": [
    [
      5.16257381439209,
      4.463251113891602,
      -0.9947075247764587
    ],
    "In the case of Casolare v. County of Onondaga, the plaintiff, Veronica Casolare, alleged gender-based discrimination, harassment, and retaliation while employed as a Deputy Sheriff. The court denied summary judgment for her hostile work environment claims, determining that the alleged harassment by former Sergeant O'Dell was severe enough to create a hostile work environment. However, the court granted summary judgment on her quid pro quo sexual harassment and retaliation claims, as well as on her equal protection claim under the Fourteenth Amendment. Additionally, the individual defendants were granted qualified immunity."
  ],
  "2024-06-04_USCOURTS-ord-3_21-cv-00416_Cobb v. Intel Corporation.pdf": [
    [
      5.0605902671813965,
      4.575234413146973,
      -1.111802101135254
    ],
    "In the case of Cobb v. Intel Corporation, the plaintiff, Daniel Cobb, alleged wrongful termination based on age discrimination and retaliation for reporting nepotism and age discrimination. The court granted Intel's motion for summary judgment, finding that Cobb failed to establish a prima facie case for age discrimination, as his replacement was of a similar age, and did not demonstrate that Intel's reasons for his termination were pretextual. The court also ruled that Cobb did not provide sufficient evidence of a causal link between his reports of nepotism and his subsequent discipline or termination."
  ],
  "2024-07-03_USCOURTS-pamd-4_19-cr-00207_USA v. Bressi et al.pdf": [
    [
      4.793429374694824,
      3.5111935138702393,
      -0.0017971935449168086
    ],
    "In the case of USA v. Anthony D. Bressi, pending in the Middle District of Pennsylvania, the court addressed a Daubert motion filed by Bressi to exclude expert testimony from government forensic chemists Joseph Bozenko and Rebecca Patrick. The court found both experts qualified and their methods reliable, allowing them to testify about the analysis of chemicals found in a suspected drug manufacturing lab. However, the court partially granted Bressi's motion due to the government's repeated failures to comply with disclosure requirements under Federal Rule of Criminal Procedure 16, which denied Bressi fair notice to challenge certain opinions."
  ],
  "2025-01-30_USCOURTS-mnd-0_23-cv-02789_Pettit v. Allina Health System.pdf": [
    [
      5.259856700897217,
      3.7319071292877197,
      0.1830427199602127
    ],
    "The case 'Pettit v. Allina Health System' revolves around allegations of racial discrimination made by DaJovan Pettit against her former employer, Allina Health System. The court addressed Allina's motions for attorneys’ fees related to a motion to compel and sanctions against Pettit's attorney for filing false claims derived from another case, ultimately recommending dismissal of Pettit's claims with prejudice and imposing monetary sanctions against her attorney, Richard Hechter, for his unethical conduct in misrepresenting facts and failing to adequately communicate with his client."
  ],
  "2024-03-04_USCOURTS-txwd-5_22-cv-00869_Roe v. United States of America et al.pdf": [
    [
      3.5924482345581055,
      3.557807207107544,
      -0.5544543266296387
    ],
    "In the case Roe v. United States of America, Dr. John Roe, a scientist specializing in AI and machine learning, alleged that U.S. Air Force personnel retaliated against him by initiating a fraudulent investigation that led to his de facto debarment from government contracting opportunities after he criticized a competing project. The court granted Dr. Roe's claims for equitable relief related to his debarment to proceed while dismissing his claims under the Privacy Act and the Federal Tort Claims Act due to sovereign immunity. The case highlights the challenges faced by individuals in government contracting who may be adversely affected by internal disputes and official retaliation."
  ],
  "2024-09-06_USCOURTS-pamd-4_19-cr-00207_USA v. Bressi et al.pdf": [
    [
      4.850604057312012,
      3.360440969467163,
      -0.33850815892219543
    ],
    "In the case of USA v. Anthony D. Bressi, the defendant was indicted on charges related to conspiracy and possession with intent to distribute controlled substances. Over the course of five years, Bressi filed numerous pretrial motions, including attempts to dismiss the indictment based on alleged immunity agreements and destruction of evidence, all of which were denied by the court. Additionally, Bressi sought to suppress evidence seized through grand jury subpoenas and other means, but the court maintained that the government acted within its rights, rejecting Bressi's arguments for suppression and dismissal. Ultimately, the judge denied all of Bressi's motions, allowing the case to proceed to trial."
  ],
  "2019-07-15_USCOURTS-nyed-1_19-cr-00029_USA v. Shipp.pdf": [
    [
      4.881591320037842,
      3.181882619857788,
      -1.1283701658248901
    ],
    "In the case of USA v. Alonzo Shipp, the United States District Court for the Eastern District of New York ruled on a motion to suppress evidence obtained from Shipp's Facebook account following a shooting incident. The court found that the Facebook warrant, which was issued based on probable cause, was not overbroad in violation of the Fourth Amendment, and even if it had been, the good-faith exception applied. Consequently, the court denied Shipp's motion to suppress the evidence collected from his Facebook account."
  ],
  "2004-10-25_USCOURTS-ohsb-3_03-bk-40549_The Sterling Rubber Products Company.pdf": [
    [
      5.435606479644775,
      4.020219326019287,
      0.6097121834754944
    ],
    "In the case of The Sterling Rubber Products Company, the United States Bankruptcy Court denied Spencer Central Developers, LLC's motions to have its proof of claim deemed timely filed and for relief from judgment after it failed to file a timely response to the debtor's objection to its claim. SCD had submitted its proof of claim one day past the bar date and did not respond to the objection within the specified timeline. The court ruled that SCD did not demonstrate excusable neglect for its omissions, emphasizing the importance of adhering to procedural rules in bankruptcy cases."
  ],
  "2013-08-12_USCOURTS-cand-3_12-cv-06232_Heller Ehrman LLP et al.pdf": [
    [
      4.973811626434326,
      4.168963432312012,
      0.8560389280319214
    ],
    "In the case of Iris Biotechnologies, Inc. v. Heller Ehrman LLP, the United States District Court for the Northern District of California affirmed the bankruptcy court's decision to deny Iris's motion for a late filing of a malpractice claim against its former counsel, Heller. Iris, founded by Simon Chin and involved in developing artificial intelligence systems for genetic analysis, claimed malpractice related to the handling of its patent applications. However, the court found that Iris failed to act in a timely manner, having received ample warnings from Heller concerning the need to protect its legal rights, leading to the dismissal of its claims."
  ],
  "2013-02-28_USCOURTS-azd-2_12-cv-00540_Silver v. Colvin.pdf": [
    [
      5.255349636077881,
      4.381221771240234,
      -0.9599629640579224
    ],
    "In the case Silver v. Colvin, the U.S. District Court for the District of Arizona reviewed Timothy L. Silver's appeal against the decision of the Social Security Administration, which denied him disability benefits based on his claims of significant cognitive and physical impairments. The court found that the Administrative Law Judge (ALJ) had failed to adequately evaluate Silver's subjective testimony and the supporting testimony from his mother and a nurse practitioner, resulting in insufficient reasoning for denying benefits. On February 28, 2013, the court reversed the ALJ's decision and ordered a remand for an award of benefits, concluding that the evidence, if properly credited, would compel a finding of disability."
  ],
  "2024-01-22_USCOURTS-azd-4_22-cv-00339_Crago _115357 v. Shinn et al.pdf": [
    [
      5.626927375793457,
      3.5959200859069824,
      -1.3140742778778076
    ],
    "The case involves Earl Felton Crago, Jr. petitioning against David Shinn and others in the United States District Court for the District of Arizona for a Writ of Habeas Corpus. The court reviewed a Report and Recommendation by Magistrate Judge Ambri, which recommended dismissal of the petition. After considering Crago's objections and conducting a de novo review of the record, the court found the objections without merit, adopted the Magistrate's recommendations, and dismissed the petition. The case does not pertain to artificial intelligence or machine learning."
  ],
  "2023-09-28_USCOURTS-azd-4_22-cv-00269_Loreto v. Arizona Board of Regents et al.pdf": [
    [
      5.656589984893799,
      3.587984800338745,
      -1.2672227621078491
    ],
    "In the case of Loreto v. Arizona Board of Regents (CV-22-00269-TUC-JAS), the United States District Court for the District of Arizona reviewed a Report and Recommendation issued by Magistrate Judge Martinez regarding a motion to dismiss. The Court granted in part and denied in part the motion after conducting a de novo review of the case's record, finding the objections raised by the defendant to be without merit and adopting the magistrate's analysis. The decision emphasizes the Court's case management practices, which prioritize efficiency and adherence to established legal standards."
  ],
  "2024-03-29_USCOURTS-azd-4_23-cv-00109_Salisbury v. United States of America.pdf": [
    [
      5.724614143371582,
      3.4612984657287598,
      -1.23006272315979
    ],
    "In the case of Salisbury v. United States, the U.S. District Court for the District of Arizona reviewed and adopted a Report and Recommendation issued by Magistrate Judge Aguilera, which recommended the denial and dismissal with prejudice of Salisbury's petition for a writ of habeas corpus. The court also denied Salisbury's motions for injunctive relief and default judgment, citing that any new arguments presented in objections were considered waived. The court conducted a de novo review of the record and found no merit in the objections."
  ],
  "2025-03-21_USCOURTS-mied-4_21-cv-12589_Loyer v. Michigan_ Wayne County et al.pdf": [
    [
      4.917694568634033,
      3.6018826961517334,
      -1.4220433235168457
    ],
    "In the case of Loyer v. Wayne County Michigan, the plaintiff, as the personal representative for the estate of Gary Loyer, sued Wayne County and several individual officials under 42 U.S.C. § 1983 for alleged violations of Loyer's Eighth and Fourteenth Amendment rights following his suicide in the Wayne County Jail. The court granted the defendants' motion for summary judgment, finding no evidence that Loyer demonstrated a risk of suicide while in custody, nor that the defendants were deliberately indifferent to such a risk. The case highlighted the absence of factual support for claims that the County's policies contributed to Loyer's death, leading to the dismissal of all claims."
  ],
  "2025-03-31_USCOURTS-flsd-0_24-cv-60715_Anderson v. MSC Cruises_ S.A..pdf": [
    [
      5.451236724853516,
      4.074615478515625,
      -1.282881736755371
    ],
    "In the case of Anderson v. MSC Cruises, S.A., the U.S. District Court for the Southern District of Florida considered MSC's motion to compel arbitration in a personal injury claim filed by Marlon Leonel Mitchell Anderson, who was injured while working on an MSC cruise ship. The court, after reviewing a magistrate judge's report which recommended granting the motion based on equitable estoppel principles, concluded that MSC could compel arbitration despite being a non-signatory to the employment contract because Anderson's claims were sufficiently intertwined with the contractual obligations. The court affirmed the magistrate's report and granted MSC's motion, staying the case pending arbitration."
  ],
  "2016-04-19_USCOURTS-ca5-15-30516_USA v. Jason Scott.pdf": [
    [
      4.879929065704346,
      3.053797721862793,
      -1.0534496307373047
    ],
    "Jason Daniel Scott pleaded guilty to possessing child pornography and was sentenced to 108 months in prison along with lifetime supervised release. He appealed the district court's calculation of the Sentencing Guidelines and the imposed conditions of his supervised release. The Fifth Circuit vacated his sentence and remanded the case for resentencing, determining that the district court made procedural errors in applying a five-level sentencing enhancement related to distribution of child pornography and imposed overly broad conditions of supervised release prohibiting internet access and contact with minors. The court emphasized the necessity for such conditions to be narrowly tailored."
  ],
  "2006-03-31_USCOURTS-ned-4_05-cv-03153_Lin v. University of Nebraska.pdf": [
    [
      4.910041332244873,
      4.725506782531738,
      -0.8885498046875
    ],
    "In Lin v. University of Nebraska, Yu Lin, a graduate student, sued the University for discrimination in education and employment under Title IX and Title VII, as well as defamation and negligence. She alleged that her dismissal from the Computer Science PhD program was based on sex discrimination after she failed to pass qualifying examinations, while similarly situated male students were readmitted. The court reviewed claims of discrimination and retaliation, ultimately granting summary judgment in favor of the University on most claims, while taking under advisement issues related to her dismissal and job application opportunities."
  ],
  "2025-03-26_USCOURTS-cand-3_23-cv-06286_Cheteni v. Vella_ et al..pdf": [
    [
      5.176591396331787,
      3.995788097381592,
      -1.0495898723602295
    ],
    "In the case of Freedom Cheteni v. Malia Vella et al., the plaintiff claims discrimination and retaliation by state officials regarding the Emergency Assistance for Non-Public Schools (EANS) program. The court partially granted and denied the defendants' motion for judgment on the pleadings, dismissing two claims with prejudice while allowing others to proceed, including allegations of due process violations and retaliation. The ruling emphasizes the importance of standing and identifies that Cheteni has enough personal harm to pursue certain constitutional claims, even though the claims related to racial discrimination in contract under § 1981 were dismissed due to lack of standing."
  ],
  "2022-10-20_USCOURTS-ksd-5_22-cv-03264_Strader _ID 66677_ v. State of Kansas et al.pdf": [
    [
      5.285763263702393,
      3.0000579357147217,
      -1.387107253074646
    ],
    "The case involves James Strader, who filed a pro se petition for a writ of habeas corpus under 28 U.S.C. § 2241, challenging his state convictions related to kidnapping and attempted rape. The court directed Strader to show cause why the petition should not be dismissed for failure to state a claim for which relief could be granted, noting that many of his claims were more suitable for relief under § 2254 or related to conditions of confinement appropriate for a § 1983 action. Strader's allegations included suppressed evidence of his innocence and conditions surrounding his incarceration, including claims related to 'experimental surveillance' and 'smart dust technology,' referencing potential abuses involving artificial intelligence in monitoring inmates."
  ],
  "2021-06-14_USCOURTS-txsd-4_20-cv-03315_Omoyosi v. Texas Health and Human Services Commission.pdf": [
    [
      5.097898483276367,
      4.128191947937012,
      -1.1755290031433105
    ],
    "In the case of Omoyosi v. Texas Health and Human Services Commission, Dr. Adekunle C. Omoyosi, a pharmacist, alleged racial discrimination under Title VII after being denied employment for several positions. The court recommended granting the defendant's motion to dismiss, citing lack of standing for Omoyosi's claims regarding COVID-19 responses and insufficient factual basis for his Title VII claims. Additionally, it suggested denying Omoyosi's motion to amend his complaint as futile, concluding that he had not demonstrated the necessary legal injuries or specific details to support his assertions."
  ],
  "2024-08-05_USCOURTS-cand-3_23-cv-01161_Bonazza v. MUFG Bank_ Ltd..pdf": [
    [
      5.493021488189697,
      3.5679476261138916,
      -0.18066520988941193
    ],
    "In the case of Bonazza v. MUFG Bank, the plaintiff, Michael Alan Bonazza, faced sanctions for abusive litigation tactics, including sending thousands of irrelevant and harassing emails to court staff and defendant's employees. The court granted a protective order against these practices, allowing Bonazza one last opportunity to comply with court orders. The court emphasized the need for effective case management and warned that further noncompliance could result in dismissal of his case. The motion for summary judgment from both parties was also scheduled, with strict rules for future communications."
  ],
  "2024-10-10_USCOURTS-ca6-23-05928_USA v. Sylvester Gailes.pdf": [
    [
      4.92661714553833,
      3.052745819091797,
      -1.171126127243042
    ],
    "In the case of USA v. Sylvester Gailes, the Sixth Circuit upheld the constitutionality of 18 U.S.C. § 922(g)(9), which prohibits individuals convicted of domestic-violence misdemeanors from possessing firearms. Gailes, a repeat domestic violence offender, challenged the statute as a violation of his Second Amendment rights, citing the Supreme Court's ruling in Bruen. The court ruled that despite Bruen's implications, the law is consistent with historical firearm regulation traditions that aim to prevent violence by individuals posing a clear threat, thereby affirming the lower court's decision and denying Gailes's motion to dismiss the indictment."
  ],
  "2025-04-02_USCOURTS-nmd-2_25-cv-00052_Dehghani v. Castro.pdf": [
    [
      5.528414726257324,
      3.291706085205078,
      0.17264343798160553
    ],
    "In the case of Dehghani v. Castro, attorney Felipe D.J. Millan faced sanctions for submitting a habeas corpus response that cited non-existent cases, which he attributed to an assistant at LAWCLERK who drafted the response. The court found that Mr. Millan failed to adequately review the document before filing it, violating Rule 11 of the Federal Rules of Civil Procedure. The reliance on AI-generated or inaccurately referenced case law was a significant factor in the sanctions imposed, highlighting the responsibility of attorneys to verify the accuracy of submissions regardless of the sources used, including outsourced legal work."
  ],
  "2024-01-26_USCOURTS-txed-4_21-cv-00626_Palardy v. AT_T Services_ Inc. et al.pdf": [
    [
      5.003520488739014,
      4.213765621185303,
      -1.1179314851760864
    ],
    "In the case Palardy v. AT&T Services, Inc., et al., Plaintiff Francis Palardy alleges employment discrimination based on a severe hearing disability under the Americans with Disabilities Act (ADA) and Rehabilitation Act. The court found that Palardy failed to provide sufficient facts to establish a claim against the staffing agency Experis US, Inc. Specifically, Palardy did not demonstrate Experis's involvement in the discrimination or provide adequate detail about their role, leading to the dismissal of his claims with prejudice. The case does not appear to involve artificial intelligence or automated systems."
  ],
  "2025-05-14_USCOURTS-cand-4_24-cv-07125_Lazares v. Shopify _USA__ Inc._.pdf": [
    [
      5.241037368774414,
      4.400559902191162,
      -0.9469619989395142
    ],
    "In the case of Lazares v. Shopify (USA) Inc., the plaintiff, Matthew Lazares, filed a putative class action alleging that Shopify misclassified him and other commissioned sales employees as exempt from overtime pay in violation of California labor laws. The U.S. District Court for the Northern District of California granted Shopify's motion for judgment on the pleadings, determining that Lazares failed to demonstrate he lacked an adequate remedy at law to pursue his claims under the California Unlawful Competition Law (UCL) and lacked standing to seek injunctive relief due to not alleging imminent harm as a former employee. The court dismissed Lazares's UCL claim without leave to amend."
  ],
  "2024-12-03_USCOURTS-dcd-1_23-cv-00719_RUBIO v. DISTRICT OF COLUMBIA DEPARTMENT OF HUMAN SERVICES.pdf": [
    [
      5.192225933074951,
      3.7783353328704834,
      -1.193190574645996
    ],
    "In the case of Yasmani Gurri Rubio v. District of Columbia, the U.S. District Court denied the plaintiff's motion for leave to file a second amended complaint regarding claims related to the termination of his health insurance by the District of Columbia and its officials. The court found that the proposed amended complaint, despite being Rubio's fourth attempt, did not cure previous deficiencies or provide sufficient detail to support his claims, including those under 42 U.S.C. § 1983. Notably, the proposed complaint appeared to include fabricated case citations, likely generated by artificial intelligence, which raised concerns about the validity of Rubio's allegations and compliance with legal standards. The court ultimately dismissed the federal claims with prejudice and declined to exercise supplemental jurisdiction over the related state law claims."
  ],
  "2023-08-10_USCOURTS-ctd-3_22-cv-01065_Flynn et al v. Verizon Wireless et al.pdf": [
    [
      4.84254789352417,
      3.9932329654693604,
      -1.0729126930236816
    ],
    "In the case of Flynn et al. v. Verizon Wireless et al., the plaintiff John Flynn filed a pro se complaint alleging that the installation of 5G networks in Connecticut was part of a conspiracy between government and industry to harm the population. The court found that Flynn failed to establish standing, as he did not provide concrete details of personal injury or plausible claims against the defendants. Consequently, the court granted the defendants' motions to dismiss the case without prejudice, allowing Flynn the opportunity to amend his complaint by a specified deadline."
  ],
  "2024-06-17_USCOURTS-cofc-1_24-cv-00242_ALJINDI v. USA.pdf": [
    [
      3.6958019733428955,
      3.573204755783081,
      -0.5971276760101318
    ],
    "Dr. Ahmad Aljindi filed a lawsuit against the United States, seeking $65.4 million for a Fifth Amendment takings claim and alleged retaliation by the Small Business Administration (SBA). He claimed that the government utilized his research on Information Security, AI, and Legacy Information Systems without permission, constituting a taking of his intellectual property. The court dismissed the case for lack of jurisdiction, finding the takings claim time-barred, precluded by res judicata from earlier litigation, and not sufficiently plausible. The retaliation claim, related to the denial of an Economic Injury Disaster Loan for his business, was also dismissed as he was not permitted to represent his business pro se, violating court rules."
  ],
  "2020-11-24_USCOURTS-njd-2_18-cv-12650_CHEN v. KPMG_ LLP. et al.pdf": [
    [
      4.9964165687561035,
      4.633194923400879,
      -1.062046766281128
    ],
    "In the case of Aidong Chen v. KPMG LLP, the U.S. District Court for the District of New Jersey granted KPMG's motion for summary judgment on Chen's claims of race and national origin discrimination, as well as retaliation under Title VII of the Civil Rights Act. The court found that Chen failed to provide sufficient evidence to support his claims, noting that he did not demonstrate that he suffered discrimination or retaliation related to any protected activity. Chen's allegations centered around his poor performance review and subsequent termination, which he believed were due to personal conflicts with his supervisors and not due to discriminatory practices."
  ],
  "2025-04-24_USCOURTS-dcd-1_25-cv-01121_SULTAN et al v. TRUMP et al.pdf": [
    [
      3.582279682159424,
      4.072473526000977,
      -0.6950496435165405
    ],
    "In the case Sultan et al v. Trump et al, Plaintiff Ahwar Sultan, a graduate student, sought a Temporary Restraining Order against the revocation of his F-1 visa and termination of his SEVIS record following his participation in a protest. The court found that Sultan demonstrated a likelihood of irreparable harm due to the uncertainties surrounding his legal status and employment, as well as the potential for deportation. The court granted the motion in part, ordering the reinstatement of Sultan's SEVIS record and preventing any modifications based on his past arrest, highlighting concerns over due process violations in the handling of his case. The case referenced a 'Catch and Revoke' program that utilizes artificial intelligence to target visa holders who may support designated terror groups."
  ],
  "2024-09-16_USCOURTS-txwd-1_23-cv-00545_Gray v. Experian Information Solutions_ Inc..pdf": [
    [
      5.129917621612549,
      4.376274108886719,
      -1.0021543502807617
    ],
    "In the case of Gray v. Experian Information Solutions, the court granted Experian's motion for summary judgment, concluding that the plaintiff, Thomas Gray, did not provide sufficient evidence to support his claims under the Fair Credit Reporting Act (FCRA). Gray alleged that Experian reported inaccurate information regarding his credit history, but the court found no genuine issue of material fact as Gray's evidence was deemed unverified and inconclusive. The decision emphasized that Gray failed to establish inaccuracies in the reported data, the reasonableness of Experian's procedures, and did not demonstrate causation for any alleged damages."
  ],
  "2021-05-18_USCOURTS-ksd-5_21-cv-04021_Jones v. Patents and Trademarks Commissioner.pdf": [
    [
      5.229345321655273,
      3.2550618648529053,
      -1.554421067237854
    ],
    "Joseph Lee Jones filed a lawsuit against the Patents and Trademarks Commissioner without paying the required filing fee, seeking to proceed in forma pauperis (IFP). The court recommended dismissal of the case because Jones was deemed a 'prisoner' under the PLRA's three-strikes provision, having accumulated more than three strikes from previous frivolous lawsuits. Additionally, the court found that his complaint, broadly alleging issues with obtaining patent protection for his intellectual property related to artificial intelligence, failed to state a recognizable legal claim and was incomprehensible. Thus, the court recommended that Jones' motion to proceed IFP be denied and the case dismissed."
  ],
  "2024-09-13_USCOURTS-njd-2_23-cv-02239_LEE v. ELECTRIFAI_ LLC et al.pdf": [
    [
      4.886984825134277,
      4.809162616729736,
      -0.7733531594276428
    ],
    "In the case of Lee v. ElectrifAi, LLC et al., Plaintiff Zonna Lee alleged retaliation and discrimination after her termination from ElectrifAi, where she claimed to have been subjected to a hostile work environment and misleading representations about the company's AI products. The court granted the defendants' motions to dismiss the Amended Complaint, primarily on the grounds of failure to plead adequate claims under Title VII and New Jersey laws, including lack of allegations concerning administrative exhaustion for her federal claims and insufficient factual basis for other claims including hostile work environment, emotional distress, and fraud. Specific allegations were made about the dysfunctionality of ElectrifAi's AI products, which were reported to be operated manually rather than by the advanced technologies promised."
  ],
  "2025-01-15_USCOURTS-ned-8_24-cv-00352_Strong et al v. Rushmore Loan Management Services et al.pdf": [
    [
      5.056061267852783,
      4.361983299255371,
      0.05035271868109703
    ],
    "In the case of Strong et al v. Rushmore Loan Management Services et al., the plaintiffs, Mike and Maureena Strong, who have a history of litigation regarding their property in Gretna, Nebraska, sued several defendants including mortgage servicing companies and their legal representatives, alleging wrongful acts related to a foreclosure and sheriff's sale of their property. The court dismissed the Strong's complaint, finding that their claims were barred by the Rooker-Feldman doctrine, which prevents federal courts from reviewing state court judgments, and res judicata, due to a prior dismissal in a bankruptcy court. Additionally, the court noted suspicious errors in the case citations used by the Strongs, indicating a possible reliance on generative AI to prepare their pleadings, which could lead to sanctions for submitting fabricated legal references."
  ],
  "2010-08-30_USCOURTS-nyeb-1_09-bk-40901_Caritas Health Care_ Inc..pdf": [
    [
      5.401504993438721,
      3.999330520629883,
      0.5562593936920166
    ],
    "In the case of Caritas Health Care, Inc., Neat Heat & Cooling, Inc. sought to have its late claims deemed timely filed despite missing the established bar date due to a perceived miscommunication with its attorney regarding who would file the claims. The court determined that Neat Heat had received actual notice of the bar date, as it was served to its attorney, and ruled that the reasons for the late filing were insufficient to constitute excusable neglect. Consequently, the court denied Neat Heat's motion."
  ],
  "2024-03-22_USCOURTS-nyed-2_20-cv-01705_Lee v. Delta Airlines_ Inc. et. al..pdf": [
    [
      5.319210052490234,
      4.028097152709961,
      -1.304583191871643
    ],
    "In the case of Lee v. Delta Airlines, Inc., the plaintiff, Jae Lee, a New York attorney proceeding pro se, alleged racial discrimination against Delta Airlines following an incident on a flight in 2019. After a lengthy procedural history, including motions for summary judgment and amendments to the complaint, the court granted Delta's motion for summary judgment, finding no merit in Lee's claims, especially under 42 U.S.C. § 1981. The court dismissed Lee's complaint along with her motions to amend and withdraw claims, leading to the conclusion that there were no remaining causes of action."
  ],
  "2012-10-30_USCOURTS-nmb-1_07-bk-10502_Lorina T. Gutierrez.pdf": [
    [
      5.468034744262695,
      3.9441568851470947,
      0.525304913520813
    ],
    "In the bankruptcy case of Lorina Gutierrez, the United States Bankruptcy Court for the District of New Mexico granted Deutsche Bank National Trust Company's motion for leave to file a late response to the Trustee's Notice of Final Cure Payment. The Court found that the creditor's delay was due to excusable neglect and that allowing the late response would not be prejudicial, as the debtor did not oppose the extension. Consequently, the creditor's response was deemed timely, and the trustee's request for sanctions was denied."
  ],
  "2024-12-18_USCOURTS-mad-1_24-cr-10107_USA v. Thompson III.pdf": [
    [
      4.6595072746276855,
      3.1758193969726562,
      -0.8747499585151672
    ],
    "Estes Carter Thompson III was indicted on charges of sexual exploitation of children and possession of child pornography after allegedly recording a 14-year-old girl using an aircraft bathroom and possessing explicit images from his iCloud account, some of which appeared to be AI-generated. The court denied Thompson's motion to dismiss the indictment, asserting it was sufficiently specific and that venue in Massachusetts was appropriate as the charges stemmed from conduct that occurred during the flight from Charlotte to Boston."
  ],
  "2025-06-11_USCOURTS-ned-8_25-cv-00059_Case Name in Immigration Case - Unavailable.pdf": [
    [
      3.687150716781616,
      3.9584600925445557,
      -0.7031429409980774
    ],
    "In the case of Patel v. Director, USCIS, Harshkumar Patel, an Indian national, filed a lawsuit against the USCIS Director due to delays in processing his I-918 Petition for U Nonimmigrant Status and his Application for Employment Authorization. He claimed that the delay was unlawful and harmful, seeking judicial intervention under the Administrative Procedure Act (APA). The court ruled that it lacked jurisdiction over the claim, as the discretion regarding employment authorization under the U-Visa process was established by statute, which precluded judicial review. Consequently, Patel's complaint was dismissed without prejudice."
  ],
  "2025-01-24_USCOURTS-prd-3_22-cv-01419_Lignos-Lopez et al v. Servicios de Terapia Educativa Girasol_ Inc. et al.pdf": [
    [
      5.35797643661499,
      3.9537529945373535,
      -1.0934087038040161
    ],
    "In the case of Lignos-Lopez et al. v. Servicios de Terapia Educativa Girasol, Inc. et al., the United States District Court for the District of Puerto Rico considered a motion for reconsideration regarding its prior dismissal of the plaintiffs' complaint, which alleged harm to their minor son while receiving special education services. The court initially dismissed the case due to the plaintiffs' failure to exhaust administrative remedies under the Individuals with Disabilities Education Act (IDEA). However, the court found that recent Supreme Court precedent indicated that such exhaustion was not required for claims seeking compensatory damages, which the plaintiffs asserted. The court granted the motion for reconsideration, allowing the plaintiffs to show cause why their case should not be dismissed for failure to state a claim, while reserving judgment on the exhaustion issue."
  ],
  "2023-12-05_USCOURTS-hid-1_21-cv-00368_Monet v. State of Hawaii et al.pdf": [
    [
      5.630141735076904,
      3.4213883876800537,
      -1.036495327949524
    ],
    "In the case of Sam Monet v. State of Hawaii et al, the U.S. District Court denied Plaintiff's Motion for Reconsideration of a prior order from October 31, 2023, which had granted summary judgment to several defendants and denied Plaintiff's motion for partial summary judgment. The court found that Plaintiff's arguments for reconsideration were untimely and did not demonstrate extraordinary circumstances. Additionally, the court dismissed Plaintiff's Second Motion for Judicial Disclosure, stating that no remaining claims warranted such disclosure. Notably, Plaintiff raised unsubstantiated allegations that the court's earlier order was generated by artificial intelligence, but these claims were dismissed as lacking factual basis."
  ],
  "2025-04-23_USCOURTS-nyed-2_20-cv-05615_Ferlito v. Harbor Freight Tools USA_ Inc..pdf": [
    [
      4.712911605834961,
      3.7618985176086426,
      0.11893483251333237
    ],
    "In the case of Ferlito v. Harbor Freight Tools USA, Inc., the plaintiff, Joseph Ferlito, sued the defendant for a defective axe that caused him injuries. The court denied the defendant's motion to exclude the plaintiff's proposed expert witness, Mark Lehnert, despite arguments challenging his qualifications and the reliability of his testimony. Notably, during the proceedings, Lehnert had utilized ChatGPT to confirm his findings, which the court found did not impair his independent judgment or the reliability of his testimony."
  ],
  "2023-08-25_USCOURTS-akd-1_23-cv-00002_Coleman v. The City and Borough of Juneau et al.pdf": [
    [
      4.901043891906738,
      3.619326591491699,
      -1.1397608518600464
    ],
    "William Lorenzo Coleman filed a civil rights lawsuit under 42 U.S.C. § 1983 against the City and Borough of Juneau and police officer Tyler Reid, claiming various constitutional violations stemming from his arrest on September 25, 2020, including excessive force, malicious prosecution, and fabrication of evidence. The court dismissed Coleman's complaint for failing to meet the necessary pleading requirements but granted him leave to amend his complaint by providing more specific allegations. The complaint made references to 'Artificial Intelligence' in the context of fabricated evidence, suggesting that Coleman claimed police planted evidence related to AI; however, the court did not find adequate factual support or clarity regarding how AI was involved in the alleged misconduct."
  ],
  "2025-04-29_USCOURTS-ksd-6_25-cv-01045_Hancock v. United States of America.pdf": [
    [
      4.182695388793945,
      3.379283905029297,
      -1.0727765560150146
    ],
    "In the case of Kimberly D. Hancock v. United States of America, the plaintiff, proceeding pro se, filed a complaint claiming damages related to an artificial intelligence (AI) program run by a defense contractor, Crest Security. Hancock alleged that she was unlawfully held within a CIA container for AI research since her birth in 1973. However, the court recommended dismissal of her complaint for failure to state a claim, noting that it lacked specific allegations against the United States and did not identify any constitutional violations. Additionally, the court raised concerns about the statute of limitations, as the events in question occurred over 50 years ago."
  ],
  "2024-11-26_USCOURTS-med-2_23-cv-00380_UMB BANK v. GAUTHIER.pdf": [
    [
      5.61913537979126,
      3.4291155338287354,
      -1.0534136295318604
    ],
    "In the case UMB Bank National Association v. Margaret L. Gauthier, the U.S. District Court for the District of Maine denied Gauthier's amended emergency motion for a temporary restraining order (TRO) and a stay of a receivership order. Gauthier's motions were criticized for containing numerous misquotations and miscitations, which the Court suspected may have resulted from her reliance on artificial intelligence software in drafting her submissions. The Court found that Gauthier failed to demonstrate a likelihood of success on the merits, irreparable harm, or that the balance of equities favored her position, concluding that the arguments based on jurisdiction and standing were unpersuasive and previously addressed."
  ],
  "2022-05-10_USCOURTS-ca13-22-01117_Aljindi v. US.pdf": [
    [
      3.5182933807373047,
      3.588906764984131,
      -0.4882807433605194
    ],
    "In Aljindi v. United States, Dr. Ahmad Aljindi appealed a dismissal from the U.S. Court of Federal Claims, which ruled it lacked jurisdiction over his claims, including employment discrimination and intellectual property theft. The Federal Circuit affirmed the dismissal of these claims but vacated the ruling regarding a potential copyright infringement claim, remanding the case for further consideration. The court emphasized that the Tucker Act limits the Court of Federal Claims' jurisdiction, particularly over tort claims and employment discrimination, indicating that the district courts hold exclusive jurisdiction over such matters."
  ],
  "2024-04-25_USCOURTS-ksd-5_24-cv-03057_Allen _ID 79712_ v. Facebook et al.pdf": [
    [
      4.900479316711426,
      3.4921317100524902,
      -1.5770436525344849
    ],
    "In the case of Michael Anthony Allen v. Facebook et al., the plaintiff, an incarcerated individual, filed a pro se civil rights action under 42 U.S.C. § 1983, alleging that he was exposed to 'illegal A.I. emissions' which he claims caused him to hear voices and led to feelings of suicide. The court found the complaint largely incomprehensible and dismissed it as frivolous, stating there were deficiencies in the plaintiff's claims, particularly that the defendants (social media companies and their leaders) could not be considered state actors under § 1983. The plaintiff was ordered to provide a valid response by a specified deadline or face dismissal."
  ],
  "2025-04-15_USCOURTS-mied-2_25-cv-10524_Thomas v. Genesee County Sheriff_s Department et al.pdf": [
    [
      5.531126022338867,
      3.5562782287597656,
      -0.6256072521209717
    ],
    "In the case of Isaac Anthony Thomas v. Genesee County Sheriff's Department, the plaintiff, proceeding in forma pauperis, filed a lawsuit alleging unspecified claims against the defendants. The court addressed multiple motions, including striking the plaintiff's unauthorized reply to the defendants' answer and his notice of incorporation of his original complaint. The plaintiff was granted leave to file a second amended complaint and his requests for the appointment of counsel and submission of video evidence were denied due to procedural violations and a lack of demonstration of exceptional circumstances. The case does not explicitly involve artificial intelligence or machine learning; however, the plaintiff referenced using AI in drafting motions, which the court warned would not absolve him of responsibility for the filings."
  ],
  "2021-09-29_USCOURTS-ca3-21-01014_Aidong Chen v. KPMG LLP_ et al.pdf": [
    [
      4.9885029792785645,
      4.6459760665893555,
      -1.0415451526641846
    ],
    "Aidong Chen appealed a District Court decision granting summary judgment to his former employer, KPMG LLP, in a discrimination and retaliation case under Title VII of the Civil Rights Act. Chen, who worked on a project involving the use of graphical processing units (GPUs) in artificial intelligence, alleged that he faced harassment and discriminatory treatment from his colleagues, which ultimately led to his termination. The Court found that Chen failed to establish a prima facie case for discrimination or retaliation, as he did not provide sufficient evidence to support his claims."
  ],
  "2025-04-08_USCOURTS-gamd-5_24-cv-00388_GORDON v. WELLS FARGO BANKS NA INC.pdf": [
    [
      5.421748161315918,
      3.61019229888916,
      -0.3188120722770691
    ],
    "In the case of Gordon v. Wells Fargo Bank N.A. Inc., the pro se plaintiff, William Haywood Gordon, alleged violations related to the repossession of his vehicle and various financial transactions. The court denied most of the plaintiff's motions, including those for a more definite statement and for leave to issue subpoenas, while granting him additional time to respond to the defendant's Motion to Dismiss. The court also warned the plaintiff about the misuse of artificial intelligence in legal filings, specifically regarding the citation of potentially fabricated case law, which could lead to sanctions under Rule 11 for presenting frivolous claims."
  ],
  "2025-06-06_USCOURTS-mied-2_24-cv-11974_Perkins v. The Alcove Troy et al.pdf": [
    [
      5.307222366333008,
      3.6486687660217285,
      -0.3392094373703003
    ],
    "Rodrick Perkins, a pro se plaintiff, filed a lawsuit against The Alcove Troy and others, alleging racial discrimination and wrongful eviction after being accused of disturbing residents through alleged sexual harassment. He sought $1.2 million in damages and to nullify eviction proceedings. The case faced procedural challenges, including issues with service of process, leading to a reported recommendation that Perkins be allowed to file an amended complaint and the denial of his motion for summary judgment. The defendants also suggested that elements of Perkins' lengthy complaint resembled content generated by an AI, highlighting potential concerns regarding the nature of his filings."
  ],
  "2025-02-07_USCOURTS-ksd-5_24-cv-03216_Jones v. Armbrister.pdf": [
    [
      5.223301410675049,
      3.0275449752807617,
      -1.3560818433761597
    ],
    "In the case of Jones v. Armbrister, Petitioner Joseph Lee Jones filed a petition for a writ of habeas corpus under 28 U.S.C. § 2241, challenging his pretrial detention and competency status in relation to his probation violations in Kansas. The court found his petition difficult to understand, citing numerous unrelated claims such as issues with artificial intelligence research and online sales. Ultimately, the court determined it must abstain from intervening in ongoing state criminal proceedings based on the principles established in Younger v. Harris and Ex parte Royall, and directed Jones to show cause why the matter should not be dismissed."
  ],
  "2023-07-24_USCOURTS-paed-2_22-cv-03199_BROWN v. PORT AUTHORITY TRANSIT CORPORATION et al.pdf": [
    [
      5.1819891929626465,
      4.1974992752075195,
      -1.227120280265808
    ],
    "In the case of Brown v. Port Authority Transit Corporation, the plaintiff, Jason L. Brown, alleged racial discrimination, retaliation, and a hostile work environment under Title VII of the Civil Rights Act against his employer, PATCO, and its parent, DRPA. The court dismissed Brown's claims with prejudice, finding that he failed to provide sufficient factual allegations to support his claims, and noted that his assertions were often conclusory and insufficient to establish a plausible case for relief. The court also denied Brown's motion for judgment on the pleadings and ruled that further amendments to the complaint would be futile."
  ],
  "2023-05-05_USCOURTS-ohsd-2_20-cv-02972_Stratesphere LLC et al v. Kognetics Inc..pdf": [
    [
      4.821175575256348,
      3.901045322418213,
      0.6253815293312073
    ],
    "In the case Stratesphere LLC et al. v. Kognetics Inc., Plaintiffs sought reconsideration of a prior court order that granted summary judgment to Defendants on a fraudulent inducement claim regarding the sale of an AI software platform developed by Defendants. The court denied the motion for reconsideration, stating that Plaintiffs merely rehashed previously litigated issues without showing clear error or new evidence. Additionally, the court denied Plaintiffs' request to certify a legal question to the Supreme Court of Ohio, highlighting that such certification is not meant to offer another opportunity after an unfavorable decision."
  ],
  "2025-01-15_USCOURTS-cand-3_24-cv-09325_Fouts v. Commonwealth of Kentucky_ et al.pdf": [
    [
      5.186264514923096,
      3.7076900005340576,
      -0.8948222398757935
    ],
    "In the case of Fouts v. Commonwealth of Kentucky, pro se plaintiff John R. Fouts and his minor child filed a complaint in the Northern District of California, alleging numerous statutory and constitutional violations related to inadequate medical care and structural hazards in their home, along with issues involving child protective services. The court determined that venue was improper in California as both Fouts and many defendants resided in Kentucky, and all relevant events occurred there. Consequently, the court transferred the case to the Western District of Kentucky to serve the interests of justice and for the convenience of the parties involved."
  ],
  "2025-01-15_USCOURTS-kywd-3_25-cv-00033_Fouts v. Commonwealth of Kentucky_ et al.pdf": [
    [
      5.264114856719971,
      3.6504108905792236,
      -0.919535756111145
    ],
    "In the case of Fouts v. Commonwealth of Kentucky, pro se plaintiff John R. Fouts, along with his minor child, filed a complaint alleging multiple constitutional and statutory violations involving various Kentucky and federal agencies, mainly related to issues with social security, health care, and a Child Protective Services investigation. The Northern District of California, where the case was filed, determined that venue was improper as both plaintiffs and relevant events were centered in Kentucky. Consequently, the court transferred the case to the Western District of Kentucky for proper handling. The involvement of AI was noted in Fouts's subsequent filings, where he referenced using artificial intelligence for drafting documents, although the court did not address these filings as it focused on the venue issue."
  ],
  "2025-03-20_USCOURTS-flsd-1_25-cv-21200_Vanness v. Musk.pdf": [
    [
      4.829190254211426,
      3.521458387374878,
      -1.6063402891159058
    ],
    "In the case of Vanness v. Musk, Craig Vanness filed a class action complaint alleging that Elon Musk uses his company Neuralink for government mind control via a form of 'electronic torture' linked to an 'Acoustic Fingerprint' technology. The court dismissed Vanness's complaint with prejudice as frivolous, noting that it lacked any substantial merit and did not meet the criteria for proceeding in forma pauperis due to Vanness having three prior strike cases. The court found the claims to be delusional and a mockery of the judicial process."
  ],
  "2024-08-20_USCOURTS-hid-1_24-cv-00294_State of Hawaii et al v. Martin.pdf": [
    [
      5.32816219329834,
      3.2668256759643555,
      -1.3940268754959106
    ],
    "In the case of Austin D. Martin v. State of Hawai‘i, the United States District Court denied Martin's motion for reconsideration of a prior order that remanded his state court criminal prosecution for driving without insurance back to state court due to an untimely notice of removal and lack of jurisdiction. Martin, proceeding pro se, failed to demonstrate sufficient grounds for reconsideration under the applicable legal standards and did not satisfy the requirements for removal under 28 U.S.C. § 1443(1). The court also noted concerns regarding the accuracy of case citations and quotations in Martin's submissions, suggesting potential reliance on artificial intelligence for their generation."
  ],
  "2024-10-03_USCOURTS-ksd-5_24-cv-03172_Jones v. Armbrister.pdf": [
    [
      5.263927936553955,
      3.0433640480041504,
      -1.3752233982086182
    ],
    "In the case of Jones v. Armbrister, Joseph Lee Jones filed a petition for writ of habeas corpus challenging his recent sentencing for forgery and identity theft. Jones claims his rights were violated based on various constitutional grounds, including due process, First Amendment rights, access to the courts, and Eighth Amendment protections, while asserting that he is an 'Artificial intelligence researcher.' The court found the petition unclear and lacking specificity, necessitating that Jones file an amended petition detailing his claims and supporting facts by November 4, 2024."
  ],
  "2024-12-12_USCOURTS-ca5-23-50651_Hall v. UiPath.pdf": [
    [
      4.973260402679443,
      4.704405307769775,
      -1.0333251953125
    ],
    "In the case of Hall v. UiPath, Derek Hall appealed a summary judgment granted to UiPath, alleging retaliation under the Age Discrimination in Employment Act (ADEA) after his termination following an internal complaint of age discrimination. The Fifth Circuit upheld the district court's ruling, stating that Hall failed to demonstrate a causal link between his protected activity and his termination, and he did not adequately challenge UiPath's non-discriminatory rationale—that he was terminated due to poor performance and not fitting well with the company's sales team. The case does not directly involve artificial intelligence or automated systems but examines employment practices at a software company known for its automation solutions."
  ],
  "2021-05-17_USCOURTS-moed-4_21-cv-00275_Silva v. U.S. Army et al.pdf": [
    [
      4.1487908363342285,
      3.36650013923645,
      -1.0035675764083862
    ],
    "In the case of Clayton Silva v. U.S. Army et al., Silva, a pro se litigant, filed a convoluted complaint against various federal agencies and pharmaceutical companies, alleging conspiracy and torture involving fake prescription drugs and advanced technologies such as wireless manipulation and mind control. The defendants, including the U.S. Army, CIA, NSA, and pharmaceutical companies, filed motions to dismiss for lack of subject matter jurisdiction and failure to state a claim. The court ultimately granted the motions to dismiss, concluding that Silva's allegations were vague, unsupported, and did not meet the legal standards required for federal jurisdiction or for stating a plausible claim."
  ],
  "2023-05-19_USCOURTS-casd-3_23-cv-00832_Kemp v. Beirami.pdf": [
    [
      4.864813327789307,
      3.4600367546081543,
      -1.109892725944519
    ],
    "In the case of Bobby M. Kemp v. Ahmad Beirami, the plaintiff, a Florida prisoner, filed a civil rights action alleging that Beirami, while employed by Meta Platforms, Inc., helped design an AI machine that intercepted Kemp's electronic communications and facial recognition profile, violating federal law. The court denied Kemp's motion to proceed in forma pauperis due to his failure to submit the necessary trust fund account statement and dismissed the case without prejudice, noting that the Southern District of California may not be the appropriate venue for the action."
  ],
  "2021-03-15_USCOURTS-ksd-5_20-cv-03056_Jones v. Douglas County Jail.pdf": [
    [
      5.268383026123047,
      3.002896308898926,
      -1.3596422672271729
    ],
    "In the case of Joseph Lee Jones v. Douglas County Jail, a pro se petitioner sought a writ of habeas corpus under 28 U.S.C. § 2254 while being a pretrial detainee awaiting a competency evaluation on drug-related charges. The court found that Jones failed to exhaust his state court remedies and that his allegations of constitutional violations were primarily based on state law, which are not grounds for federal habeas relief. The court also ruled that his claims related to his right to a speedy trial were not sufficiently substantiated, and thus his petition was denied. Furthermore, numerous motions filed by Jones, including those related to grievances about jail conditions and legal representation, were also denied."
  ],
  "2024-03-05_USCOURTS-dcd-1_23-cv-01472_SHARIFYMOGHADDAM et al v. BLINKEN et al.pdf": [
    [
      3.476332187652588,
      3.9328534603118896,
      -0.5779058933258057
    ],
    "In the case of SharifyMoghaddam et al. v. Blinken et al., plaintiffs Sayeh SharifyMoghaddam and Seyyed Mahmood Jafari Sadeghi, dual Iranian and Canadian nationals, sued U.S. officials to compel a decision on their immigrant visa applications, alleging unreasonable delay. The court ultimately dismissed the case, asserting that the delays, which had extended to fifteen months since their visa interview, were not deemed unreasonable under the established TRAC factors, particularly given the absence of a statutory timeline for visa adjudication. The plaintiffs, both researchers in artificial intelligence, argued that the delay was harming their careers and mentorship opportunities, yet the court concluded that the agency's timeline was reasonable compared to precedents in similar cases."
  ],
  "2025-04-10_USCOURTS-prd-3_23-cv-01203_Puerto Rico Soccer League NFP_ Corp._ et al v. Federacion Puertorriquena de Futbol_ et al.pdf": [
    [
      5.506950378417969,
      3.333120584487915,
      0.1272992193698883
    ],
    "In the case of Puerto Rico Soccer League NFP, Corp. et al. v. Federación Puertorriqueña de Fútbol et al., the United States District Court for the District of Puerto Rico addressed multiple citation inaccuracies in the plaintiffs' motions, leading the court to conclude that the plaintiffs failed to meet their professional obligations. The court found that the citations contained significant errors, including references to non-existent cases and misattributed quotes, indicating a lack of thoroughness and preparation from the plaintiffs' counsel. Consequently, the court decided to impose sanctions on the plaintiffs' attorneys, ordering them to pay the defendants' legal fees incurred due to the filing of these flawed motions."
  ],
  "2023-07-17_USCOURTS-casd-3_23-cv-01198_Kemp v. Kuttler.pdf": [
    [
      4.931031227111816,
      3.4765682220458984,
      -1.2504746913909912
    ],
    "In the case of **Kemp v. Kuttler**, the plaintiff, Bobby M. Kemp, a Florida prisoner, filed a civil rights lawsuit alleging that Heinrich Kuttler, employed by Meta Platforms, Inc., participated in designing an AI machine that unlawfully intercepted Kemp's electronic communications and facial recognition data. The court denied Kemp's motion to proceed in forma pauperis (IFP) due to his failure to provide a required certified prison trust account statement and dismissed the action without prejudice. Additionally, the court raised concerns about whether the Southern District of California was the proper venue for the case, as the events did not occur in that jurisdiction."
  ],
  "2023-09-11_USCOURTS-ohsd-3_22-cv-00357_Whaley v. Equifax Information Services_ LLC.pdf": [
    [
      5.4639153480529785,
      3.757343292236328,
      -0.6611847281455994
    ],
    "In Whaley v. Equifax Information Services, the court conditionally granted the defendant's motion to dismiss the plaintiff's complaint for violating Federal Rule of Civil Procedure 8(a) due to its verbosity and lack of clarity regarding alleged violations of the Fair Credit Reporting Act (FCRA). The plaintiff, proceeding pro se, was given 30 days to file an amended complaint, which must clearly identify the allegedly inaccurate information provided by Equifax, its transmission dates, and recipients, with a limit of 20 pages. The case also mentioned that the plaintiff had used artificial intelligence to prepare filings in a related case, emphasizing the court's prohibition against AI usage in creating legal documents."
  ],
  "2023-04-05_USCOURTS-ca13-23-01230_Aljindi v. US.pdf": [
    [
      3.354414463043213,
      3.721811056137085,
      -0.33598339557647705
    ],
    "In the case of Aljindi v. United States, Dr. Ahmad Aljindi appealed the dismissal of his copyright infringement claim against the government, asserting that it used his intellectual property related to Information Security and Artificial Intelligence (AI). The U.S. Court of Appeals upheld the lower court's dismissal, determining that Aljindi's allegations only pertained to ideas and concepts, which are not eligible for copyright protection under U.S. law. The court found that he failed to identify any specific expression that could be copyrighted, and thus affirmed the dismissal."
  ],
  "2025-01-30_USCOURTS-txwd-1_24-cv-00880_Gonzalez v. Texas Taxpayers and Research Association.pdf": [
    [
      5.229665279388428,
      4.351850986480713,
      -0.9559245705604553
    ],
    "In the case Gonzalez v. Texas Taxpayers and Research Association (TTRA), the United States District Court for the Western District of Texas granted TTRA's motion to dismiss Rikkie Gonzalez's claims of employment discrimination, retaliation, and a hostile work environment under Title VII and the Texas Labor Code due to her failure to adequately plead that TTRA met the employee threshold required under these statutes. The court also dismissed her state law claims for emotional distress and defamation without prejudice, as it declined to exercise supplemental jurisdiction after dismissing the federal claims. Notably, the court struck Gonzalez's responsive briefing because her counsel used artificial intelligence to draft it, leading to the submission of misleading cases and errors."
  ],
  "2024-05-15_USCOURTS-ksd-5_24-cv-03057_Allen _ID 79712_ v. Facebook et al.pdf": [
    [
      4.757867813110352,
      3.634028911590576,
      -1.4898383617401123
    ],
    "In the case of Michael Anthony Allen v. Facebook et al., the plaintiff, incarcerated in Kansas, filed a pro se civil rights action under 42 U.S.C. § 1983, claiming that social media companies exposed him to harmful 'illegal A.I.' emissions that caused psychological distress and suicidal thoughts. The court found the complaint to be largely incomprehensible and lacking a plausible claim that any of the defendants were state actors, which is a requirement for § 1983 claims. The court dismissed the complaint as frivolous, stating that the allegations did not establish any actionable basis against private companies like Facebook."
  ],
  "2023-11-16_USCOURTS-ohsd-3_22-cv-00356_Whaley v. Experian Information Solutions_ Inc..pdf": [
    [
      5.391427516937256,
      3.899688959121704,
      -0.7733280658721924
    ],
    "In Whaley v. Experian Information Solutions, the plaintiff, Elijah Whaley, filed a pro se complaint alleging violations of the Fair Credit Reporting Act (FCRA). The court granted Experian's motion to dismiss due to the complaint being overly verbose, confused, and failing to meet basic pleading standards. Whaley was given leave to file an amended complaint within ten days, requiring him to specify the allegedly inaccurate information, the dates of its transmission, and the recipients, while the court warned that failure to comply could result in dismissal with prejudice."
  ],
  "2017-04-21_USCOURTS-caed-2_16-cv-02902__PS_ Caruso v. United States of America_ et al..pdf": [
    [
      3.9663126468658447,
      3.313565731048584,
      -0.8483297824859619
    ],
    "In the case of Caruso v. United States of America, the plaintiff, Steven Caruso, alleged that various federal entities had illegally consented to the use of his person and body for medical research and behavioral science experiments, claiming to be a 'U.S. government experimental subject.' The court found that Caruso's allegations were implausible and lacked merit, particularly given their reliance on concepts such as artificial intelligence and a conspiracy involving various institutions. Consequently, the court recommended dismissing the case for lack of subject matter jurisdiction."
  ],
  "2024-01-10_USCOURTS-txwd-1_23-cv-01497_Frederick v. And Company.pdf": [
    [
      5.003875255584717,
      3.4374728202819824,
      -1.7117664813995361
    ],
    "In the case of Frederick v. And Company, the plaintiff, Darion Dion Frederick, filed a complaint without a clear legal basis, seeking a vast sum in damages and making claims that lacked intelligibility and substance. The court found that his allegations failed to establish any plausible federal jurisdiction or valid legal claims, leading to a recommendation for dismissal of the case as frivolous under 28 U.S.C. § 1915(e)(2). The case does not appear to involve artificial intelligence or machine learning elements."
  ],
  "2025-01-14_USCOURTS-txwd-1_24-cv-00998_Fluckers v. Fox News Contractors et al.pdf": [
    [
      4.830918788909912,
      3.5756940841674805,
      -1.1985944509506226
    ],
    "In the case of Jermar Fluckers v. Fox News Contractors et al., Plaintiff Jermar Fluckers applied to proceed in forma pauperis, which was granted due to his indigent status. However, upon review, the Magistrate Judge recommended the dismissal of Fluckers's claims, stating that he failed to allege any specific actions taken by the defendants against him or to identify any wrongdoing. Fluckers's claims involved references to 'AI' and actions purportedly taken by people locally, including collection of personal information related to his anatomy, but he did not substantiate these allegations with concrete details or evidence against the defendants."
  ],
  "2025-05-16_USCOURTS-cand-3_23-cv-00770_Mobley v. Workday_ Inc..pdf": [
    [
      4.733975410461426,
      4.890655040740967,
      -0.8688480257987976
    ],
    "Derek Mobley filed a lawsuit against Workday, Inc., claiming that its AI-based applicant recommendation system discriminated against job applicants based on age, race, and disability, particularly impacting individuals over forty years old. Mobley seeks preliminary certification of a collective action for his Age Discrimination in Employment Act (ADEA) claim, which would allow similarly situated applicants to join him. The court granted the preliminary certification, finding that Mobley sufficiently alleged a unified policy where Workday's AI system scores, sorts, or ranks applicants, potentially leading to a disparate impact on older applicants."
  ],
  "2025-01-29_USCOURTS-txwd-1_24-cv-00880_Gonzalez v. Texas Taxpayers and Research Association.pdf": [
    [
      5.558232307434082,
      3.379101276397705,
      0.19971290230751038
    ],
    "In the case Gonzalez v. Texas Taxpayers and Research Association, the court imposed sanctions on Plaintiff’s counsel, John L. Pittman, for submitting a brief with numerous errors, including misrepresented or non-existent case citations. During the proceedings, Pittman initially denied using AI but later admitted to using an AI citation generator, attributing the mistakes to clerical errors. The court granted the defendant's motion to strike Pittman's response to the motion to dismiss, ordering Pittman to pay the defendant’s attorney fees and costs."
  ],
  "2025-06-11_USCOURTS-mied-2_24-cv-12947_Hunt v. Morissette et al.pdf": [
    [
      5.1591691970825195,
      3.598850965499878,
      0.17109878361225128
    ],
    "In the case Hunt v. Morissette, the U.S. District Court for the Eastern District of Michigan denied Plaintiff Joseph Michael Hunt's motion for reconsideration regarding an earlier order that required him to pay Defendants Alanis Morissette and Epiphany Productions Inc. $3,284.61 in attorneys' fees. Hunt argued that the Defendants' attorneys had committed 'Fraud Upon The Court' by using out-of-state counsel and based part of his argument on answers provided by an artificial intelligence program. The court ruled that the attorneys' practices did not constitute unauthorized practice of law as they complied with local and professional conduct rules, and it clarified that AI-generated material was not a valid basis for legal arguments."
  ],
  "2018-05-16_USCOURTS-pawd-2_18-cv-00605_JOHNSON v. YOUNG MONEY.pdf": [
    [
      4.779469013214111,
      3.6861374378204346,
      -1.5744073390960693
    ],
    "In the case of Asia Johnson v. Young Money, the plaintiff, representing herself, filed a complaint against the music label Young Money alleging assault, libel, slander, and copyright infringement related to her claims that her work was being used without permission. The court, however, dismissed the complaint as frivolous, determining that it was based on delusional assertions, such as allegations involving a former partner’s alleged identity change and claims of harassment facilitated by the music industry. The court found no valid basis for jurisdiction and ruled that the claims failed to present a legitimate legal theory."
  ],
  "2025-05-19_USCOURTS-cand-3_23-cv-04597_Gjovik v. Apple Inc..pdf": [
    [
      5.158328056335449,
      3.862464189529419,
      0.3628399074077606
    ],
    "In the case of Gjovik v. Apple Inc., the court addressed two motions filed by Ashley M. Gjovik: one to strike certain affirmative defenses asserted by Apple and another for a more definite statement regarding Apple's answer to her complaint. The court granted in part and denied in part the motion to strike, allowing Apple to amend its defenses for those that lacked specificity while rejecting others that were legally or factually untenable. The motion for a more definite statement was denied, as the applicable rule required a responsive pleading which was not present in this case. Additionally, the court highlighted concerns about Ms. Gjovik's use of artificial intelligence (AI) to generate legal documents, stressing her responsibility to verify the accuracy of AI-generated information."
  ],
  "2024-03-01_USCOURTS-laed-2_22-cv-02570_Whale Capital_ L.P. v. Ridgeway et al.pdf": [
    [
      5.041899681091309,
      3.802504301071167,
      0.46931469440460205
    ],
    "In the case of Whale Capital, L.P. v. Ridgeway et al., the United States District Court for the Eastern District of Louisiana addressed a Motion for Reconsideration filed by the Defendants, Christopher M. Ridgeway and FS Properties of Florida, LLC, regarding the Court's previous order on document production. The Court denied the motion, stating that the Defendants merely repeated previously rejected arguments and raised a new Rule 9(b) argument improperly for the first time in the reconsideration motion. This decision illustrates the importance of timely presenting all arguments in legal proceedings, without reliance on reconsideration as a means to introduce new claims or rehash old ones."
  ],
  "2024-04-24_USCOURTS-ca10-23-08088_Hodge v. United States.pdf": [
    [
      4.980481147766113,
      3.533048152923584,
      -1.2106136083602905
    ],
    "In the case of Hodge v. United States, Chuck Allen Hodge, a state pretrial detainee, appealed the dismissal of his complaint against the United States, which was deemed to lack jurisdiction and fail to state a claim under the Federal Tort Claims Act (FTCA). Hodge's claims included deprivation of access to legal resources and sexual assault by artificial intelligence, but the district court found that he had not identified any negligent act by a federal employee, thus protecting the United States from immunity. The Tenth Circuit dismissed Hodge's appeal as frivolous, denying his motion to proceed in forma pauperis."
  ],
  "2024-01-04_USCOURTS-mnd-0_23-cv-03804_Dopp v. Wray et al.pdf": [
    [
      4.623780727386475,
      3.5704050064086914,
      -1.349165916442871
    ],
    "The case Dopp v. Wray et al. involves plaintiff Sidney David Dopp, who filed a pro se complaint alleging harm from an implanted chip that purportedly caused him psychological and physical issues, including mind control and auditory hallucinations. The court dismissed the action as frivolous, citing the lack of specific allegations against the named defendant, Christopher Wray, and the implausibility of Dopp's claims involving artificial intelligence and other technologies that he alleged were used against him."
  ],
  "2021-07-09_USCOURTS-cand-5_21-cv-05223_Gonye v. California Department of Motor Vehicles et al.pdf": [
    [
      4.204085350036621,
      3.921895980834961,
      -0.9819834232330322
    ],
    "In the case of Gonye v. California Department of Motor Vehicles, pro se plaintiff Stephanie Gonye sought a temporary restraining order to prevent the California DMV and NASA from retaining her 2015 Toyota Prius. Gonye claimed that her friend, described as an international spy and AI developer, was involved in the situation leading to the car's impoundment for lacking registration tags. While recognizing potential irreparable harm to Gonye, the court denied her request for a restraining order, stating she did not demonstrate a likely success on the merits of her case or provide a legal basis for the car's return, despite alleging violations of her constitutional rights."
  ],
  "2024-07-01_USCOURTS-ca10-24-00010_Sherry McGann v. Jeanne Jagow.pdf": [
    [
      5.617273330688477,
      3.659257411956787,
      0.18291886150836945
    ],
    "In the case of Sherry Ann McGann v. Jeanne Y. Jagow, the Tenth Circuit Bankruptcy Appellate Panel dismissed McGann's appeal for lack of standing. The appeal stemmed from a bankruptcy court's order requiring McGann to turn over property and awarding attorney's fees to the Chapter 7 Trustee due to McGann's civil contempt. The Panel determined that McGann was not a 'person aggrieved' as she failed to object to the Fee Motion or attend the relevant hearings, thus not meeting the Tenth Circuit's prerequisites for standing. The dismissal underscores the importance of procedural compliance in bankruptcy appeals."
  ],
  "2025-06-05_USCOURTS-ned-8_23-cv-00477_Goins v. Father Flanagan_s Boys_ Home.pdf": [
    [
      5.136542320251465,
      4.052433490753174,
      -1.0973780155181885
    ],
    "In the case of Goins v. Father Flanagan's Boys' Home, the pro se plaintiff, Terry Terell Goins, alleged employment discrimination and retaliation based on sex after being terminated from his position as a Family Teacher. The court found that the plaintiff failed to provide sufficient factual allegations to support his claims, as well as not exhausting administrative remedies for his disability and age discrimination claims. Ultimately, the court dismissed the case entirely, denying the plaintiff's motion to file a second amended complaint. Notably, the case involved concerns regarding the accuracy of legal citations in the plaintiff's submissions, where the defendant suggested that generative artificial intelligence may have resulted in misleading references."
  ],
  "2024-09-25_USCOURTS-ksd-5_15-cv-03098_Jones _ID 59073_ v. United States Copyright Office and Patents.pdf": [
    [
      5.340430736541748,
      3.2319111824035645,
      -1.5416123867034912
    ],
    "In Jones v. United States Copyright Office and Patents, the plaintiff, Joseph Lee Jones, sought mandamus relief for his inability to obtain copyright and patent forms necessary for submitting research on artificial intelligence. Initially dismissed due to his failure to pay court fees under the 'three-strike' provision, Jones filed multiple motions seeking relief from judgment, which were denied by the Court. The Court concluded that his claims were incomprehensible and failed to demonstrate exceptional circumstances required for relief under Rule 60(b) of the Federal Rules of Civil Procedure."
  ],
  "2025-06-17_USCOURTS-med-1_25-cv-00180_VILLENEUVE v. MILLS et al.pdf": [
    [
      5.251445293426514,
      3.597231864929199,
      -0.8673464059829712
    ],
    "In the case of Villeneuve v. Mills, the United States District Court for the District of Maine dismissed Lionel Villeneuve's complaint against several defendants, including Governor Janet Mills and a state court judge. Villeneuve sought to remove the judge from a state court case regarding medical fees he deemed fraudulent, as well as requesting various forms of legal relief, including accommodations under the Americans with Disabilities Act. The court adopted the Magistrate Judge's recommendation to dismiss the case based on the Younger abstention doctrine, indicating that federal courts should not interfere with ongoing state proceedings and that state courts adequately address the issues raised. Notably, the case mentioned that Villeneuve relied on someone in his confidence and AI queries to present his claims, indicating the involvement of AI in seeking assistance with his legal arguments."
  ],
  "2021-02-23_USCOURTS-ksd-5_15-cv-03098_Jones _ID 59073_ v. United States Copyright Office and Patents.pdf": [
    [
      5.20763635635376,
      3.319885730743408,
      -1.65983247756958
    ],
    "In the case of Jones v. United States Copyright Office and Patents, the plaintiff, Joseph Lee Jones, sought mandamus relief, alleging difficulties in obtaining copyright and patent forms necessary for his research on artificial intelligence and for filing a patent on a concept he termed a 'Fractal.' Initially dismissed for failing to pay the filing fee due to his status as a three-strike litigant under 28 U.S.C. § 1915(g), Jones later filed a motion for relief from judgment under Rule 60(b). The court denied this motion, finding no exceptional circumstances or valid grounds for relief, as Jones attempted to revive claims made five years earlier without new evidence or justification."
  ],
  "2018-10-26_USCOURTS-nyed-1_18-cv-05251_Hill v. GoDaddy Company.pdf": [
    [
      4.651513576507568,
      3.5721476078033447,
      -1.4862107038497925
    ],
    "In the case of Hill v. GoDaddy Company, Jeramy Micheal Cordell Hill, a pro se plaintiff incarcerated at Rikers Island, filed a complaint alleging grievances against GoDaddy related to the creation of a domain name and a claim for monetary compensation. The court dismissed the complaint as frivolous, finding it nonsensical and devoid of any plausible legal claims. Hill's assertions included that the domain name 'The Social Music Club' was exceptionally intelligent, even more so than advanced technologies, and that he should have received financial compensation for it. The court determined that Hill's allegations could be classified as irrational and lacking any basis in law or fact."
  ],
  "2025-02-04_USCOURTS-cand-3_23-cv-06286_Cheteni v. Vella_ et al..pdf": [
    [
      5.636220932006836,
      3.427966356277466,
      -1.1064726114273071
    ],
    "In the case of Freedom Cheteni v. Malia Vella, the United States District Court for the Northern District of California denied Cheteni's renewed motion for a temporary restraining order (TRO) against state educational officials who had suspended federal financial assistance to his non-public school. The court found that Cheteni had not demonstrated a likelihood of success on the merits of his case and failed to make a compelling argument for reconsideration of its earlier decision. The court highlighted that there was no new relevant law or material change in facts to warrant the TRO, and noted that Cheteni's motions contained legal reasoning that was unclear and unconvincing."
  ],
  "2024-01-17_USCOURTS-ohsd-3_23-cv-00028_McComb v. Best Buy Inc. et al.pdf": [
    [
      5.370931625366211,
      3.5893478393554688,
      -0.7947798371315002
    ],
    "In the case McComb v. Best Buy Inc. et al., pro se plaintiff Robert McComb alleges he was denied customer service at two Best Buy stores due to discrimination based on race and disability. The court granted McComb leave to file a second amended complaint by January 23, 2024, emphasizing that it must comply with Federal Rule of Civil Procedure 8(a) and be no longer than 20 pages. Additionally, McComb must submit an affidavit confirming that he did not use artificial intelligence in preparing his filings, as the court prohibits the use of AI for legal documentation in this case."
  ],
  "2025-05-28_USCOURTS-insd-2_24-cv-00326_MID CENTRAL OPERATING ENGINEERS HEALTH AND WELFARE FUND v. HOOSIERVAC LLC.pdf": [
    [
      5.466786861419678,
      3.227248430252075,
      0.24258172512054443
    ],
    "In the case Mid Central Operating Engineers Health and Welfare Fund v. Hoosiervac LLC, Defendant's counsel, Rafael Ramirez, was recommended for personal sanctions due to submitting briefs that cited non-existent cases, which he admitted were generated using artificial intelligence tools without verification. The court ultimately sanctioned him $6,000 for these violations, underlining the importance of attorney responsibility and the integrity of the judicial system in the context of AI-generated content."
  ],
  "2025-03-31_USCOURTS-cofc-1_24-cv-01301_SANDERS v. USA.pdf": [
    [
      3.673651695251465,
      3.4903647899627686,
      -0.6393101811408997
    ],
    "In the case of Jerroll M. Sanders v. The United States, the plaintiff, proceeding pro se, sought over $1 billion in restitution for unjust enrichment related to the injustices of slavery in the U.S. The Court of Federal Claims dismissed the claim for lack of jurisdiction, asserting that unjust enrichment claims are based on implied-in-law contracts, which fall outside the Court's jurisdiction. Additionally, the plaintiff cited several nonexistent cases purportedly generated by artificial intelligence, which misled her legal arguments; the Court noted the dangers of AI in legal citations and warned against such practices."
  ],
  "2018-12-20_USCOURTS-ca3-18-02330_Asia Johnson v. Young Money.pdf": [
    [
      4.974380970001221,
      3.4490342140197754,
      -1.708165168762207
    ],
    "In the case of Asia Johnson v. Young Money, the Third Circuit Court of Appeals upheld the dismissal of Johnson's complaint as legally frivolous under 28 U.S.C. § 1915(e)(2)(B)(i). Johnson's claims included bizarre allegations involving harassment by members of the music industry, including references to artificial intelligence, stating that individuals were using 'artificial intelligence' to impersonate her. The court found that her claims were based on a delusional factual scenario, lacking any basis in law or fact, and determined that allowing her to amend the complaint would be futile."
  ],
  "2025-05-30_USCOURTS-ksd-6_25-cv-01045_Hancock v. United States of America.pdf": [
    [
      5.402331829071045,
      3.750504970550537,
      -1.2417433261871338
    ],
    "In the case of Hancock v. United States, Kimberly D. Hancock filed a pro se complaint against the United States, which was recommended for dismissal by Magistrate Judge Brooks G. Severson due to failure to state a claim. The court concluded that Hancock did not make any specific allegations against the United States and did not articulate a viable cause of action in relation to her claims, which included being forced into a government-run artificial intelligence program. Additionally, her objections to the Report and Recommendation were deemed improper as they introduced new concerns not directly addressing the recommendations for dismissal."
  ],
  "2024-04-01_USCOURTS-mdd-1_23-cv-02251_Kumar v. Director of U.S. Citizenship and Immigration Services.pdf": [
    [
      3.522087574005127,
      3.9695968627929688,
      -0.630206286907196
    ],
    "In the case of Kumar v. Director of U.S. Citizenship and Immigration Services, Subash Kumar, an Indian national and senior data analyst, filed a petition for an immigrant visa based on extraordinary ability in data science. The USCIS denied his application, finding he did not meet at least three of the ten regulatory criteria required for this classification. Kumar challenged the decision, claiming it was arbitrary and capricious under the Administrative Procedure Act. The court upheld the USCIS decision, stating it was well-supported and rational, as Kumar only met one of the criteria related to authorship of scholarly articles, while failing to adequately demonstrate significant contributions or acclaim in his field."
  ],
  "2025-02-21_USCOURTS-insd-2_24-cv-00326_MID CENTRAL OPERATING ENGINEERS HEALTH AND WELFARE FUND v. HOOSIERVAC LLC.pdf": [
    [
      5.59319543838501,
      3.2847156524658203,
      0.14695531129837036
    ],
    "In the case of Mid Central Operating Engineers Health and Welfare Fund v. HoosierVac LLC, attorney Rafael Ramirez faced sanctions for citing non-existent cases in legal briefs. The court found that Ramirez relied on generative artificial intelligence (AI) to draft these briefs without verifying the accuracy or existence of the cited cases, failing to conduct the requisite reasonable inquiry into the law as mandated by Federal Rule of Civil Procedure 11. The court recommended a $15,000 sanction for this misconduct and referred the matter for further disciplinary action."
  ],
  "2025-02-10_USCOURTS-ca13-24-01997_Aljindi v. US.pdf": [
    [
      3.5266146659851074,
      3.5376996994018555,
      -0.5025836229324341
    ],
    "In the case of Aljindi v. United States, Dr. Ahmad Aljindi appealed a dismissal from the U.S. Court of Federal Claims regarding his claims for compensation due to the alleged government use of his research on artificial intelligence and related systems, which he argued violated the Fifth Amendment's Takings Clause. He sought $65.4 million, claiming a taking of his intellectual property and retaliation by the Small Business Administration for a denied loan for his business, AI Net Group LLC. The Claims Court dismissed his claims for lack of jurisdiction and failure to state a viable claim, affirming that his takings claim was time-barred and barred by res judicata, and that his claims related to his LLC could not be prosecuted by him as a pro se plaintiff. Ultimately, the Federal Circuit affirmed the dismissal."
  ],
  "2022-11-28_USCOURTS-cofc-1_21-cv-01295_ALJINDI v. USA.pdf": [
    [
      3.3855645656585693,
      3.696873664855957,
      -0.3634111285209656
    ],
    "In the case of Aljindi v. USA, Ahmad Aljindi, acting pro se, claimed that the federal government infringed on his copyright related to his scientific work on Information Security, Artificial Intelligence (AI), and Legacy Information Systems. The U.S. Court of Federal Claims granted the government's motion to dismiss, finding that Aljindi failed to allege sufficient factual support for his claims, particularly because copyright protections do not extend to ideas or concepts, but only to their specific literary forms. Aljindi argued that the government infringed on his doctoral dissertation and related scientific findings, but the court concluded that he was seeking copyright for uncopyrightable ideas, and therefore dismissed the case."
  ],
  "2018-06-20_USCOURTS-txnd-3_18-cv-00719_Armbrister v. United States Department of the Treasury.pdf": [
    [
      4.477794647216797,
      3.5170509815216064,
      -1.3236104249954224
    ],
    "In the case of Armbrister v. United States Department of the Treasury, the plaintiff, Brooke Armbrister, a pro se litigant and self-described homeless resident of Dallas, filed a complaint claiming various legal rights as a Native American and presented incoherent and nonsensical arguments involving the U.S. Treasury, the FBI, and artificial intelligence. The court found her claims to be legally and factually frivolous, lacking any supporting legal authority or credible factual basis. As a result, the court recommended that her complaint be dismissed with prejudice. The mention of artificial intelligence in the case is related to Armbrister's claims of interactions with the FBI involving AI, but these assertions were deemed irrational and lacking substance."
  ],
  "2025-04-09_USCOURTS-ared-4_24-cv-01053_Aponte v. Portfolio Recovery Associates LLC.pdf": [
    [
      5.308902740478516,
      3.2695727348327637,
      -0.048558324575424194
    ],
    "Lawrence Aponte filed a case against Portfolio Recovery Associates, LLC in the Eastern District of Arkansas. The court appreciated Aponte's response to prior show cause orders but admonished him to verify all sources referenced in his filings, particularly concerning legal authorities, and to be cautious with materials found through internet searches and generated by artificial intelligence. No sanctions were imposed on Aponte."
  ],
  "2012-09-28_USCOURTS-dcd-1_11-cv-00813_MARINO v. CENTRAL INTELLIGENCE AGENCY et al.pdf": [
    [
      4.1202192306518555,
      3.334780216217041,
      -0.9995056986808777
    ],
    "Vincent Michael Marino, proceeding pro se, filed a lawsuit against multiple federal agencies under the Freedom of Information Act and Privacy Act, seeking documents related to his claim that in 1996, electronic tracking and listening devices were surgically implanted in his body during a medical procedure. The United States District Court for the District of Columbia dismissed the case as 'frivolous' and 'fantastical,' stating that Marino's allegations of government manipulation through advanced technology, including artificial intelligence and nanotechnology, were utterly unsubstantial and devoid of merit."
  ],
  "2023-11-30_USCOURTS-gamd-5_23-cv-00083_MIDDLEBROOKS v. CITY OF MACON-BIBB COUNTY GEORGIA et al.pdf": [
    [
      5.615777015686035,
      3.5657639503479004,
      0.07264047861099243
    ],
    "In Middlebrooks v. City of Macon-Bibb County, the plaintiff, Lillie M. Middlebrooks, filed a pro se complaint alleging that her property was transferred without due process through a questionable quitclaim deed. The court expressed concerns that her filings appeared to be too professionally prepared for a pro se litigant, prompting a Show Cause Order to clarify whether she received assistance from an attorney or used AI tools like ChatGPT. After Middlebrooks accused the court of racism for issuing the order and failed to respond by the deadline, the court extended her time to clarify the drafting of her pleadings, emphasizing the potential ethical violations by any aiding attorney rather than questioning her abilities."
  ],
  "2024-01-17_USCOURTS-waed-4_19-cr-06002_USA v. Linker.pdf": [
    [
      4.6089277267456055,
      3.112943172454834,
      -0.8183814287185669
    ],
    "Monica Raeven Linker, who was sentenced for receipt of child pornography and placed under supervised release, is alleged to have violated her supervision conditions. On January 16-17, 2024, monitoring software indicated that she sought and viewed AI-generated pornographic content, including images depicting minors. Despite claiming to have downloaded the application for innocuous purposes, her search terms suggested a clear intent to access illegal material. Consequently, the U.S. Probation Office has petitioned the court to issue a warrant for her appearance to address these violations."
  ],
  "2025-06-27_USCOURTS-nmd-1_23-cv-01013_Carter et al v. UZGlobal LLC et al.pdf": [
    [
      5.510889530181885,
      3.276038885116577,
      0.20267340540885925
    ],
    "In the case of Carter et al. v. UZGlobal LLC et al., a significant issue arose regarding the use of artificial intelligence in preparing legal filings. It was discovered that an associate attorney, now terminated, utilized AI to generate text in the plaintiffs' response, leading to citations of non-existent cases in their briefs. The court ordered the plaintiffs to provide an explanation of the circumstances surrounding these erroneous citations and to show cause why their counsel should not face sanctions for violations of Rule 11(b) of the Federal Rules of Civil Procedure."
  ],
  "2021-08-03_USCOURTS-mdd-1_21-cv-01836_Smith v. U.S. Department of Defense et al.pdf": [
    [
      4.1119303703308105,
      3.347947359085083,
      -1.0398191213607788
    ],
    "In the case My'Shekia Smith v. U.S. Department of Defense, the plaintiff, My'Shekia Smith, filed a complaint alleging that the U.S. government manipulated her intelligence and caused her mental trauma through modern technology, specifically by using artificial intelligence (AI). She claimed that a military jet and artificial intelligence were involved in her wrongful confinement and that an odorless chemical entered her body as a result. The court determined that her allegations were frivolous and lacked a plausible cause of action, ultimately dismissing the complaint."
  ],
  "2024-05-10_USCOURTS-mdd-1_23-cv-02102_Saas v. Major_ Lindsey _ Africa_ LLC et al.pdf": [
    [
      4.8701958656311035,
      4.792617321014404,
      -0.8487673997879028
    ],
    "Heidi Saas filed a discrimination case against Major, Lindsey & Africa, LLC, and Allegis Group, Inc. alleging violations of Title VII and the ADEA based on claims of algorithmic bias and retaliation after her interactions with a recruiter. Saas contended that the defendants used automated systems that discriminated against candidates with gaps in their resumes, particularly women returning from maternity leave, while also asserting they retaliated against her for filing an EEOC complaint. The court granted the defendants' motion to dismiss, stating that Saas' claims were speculative and insufficiently pleaded, particularly regarding the functionalities of the AI and its impact on employment referrals."
  ],
  "2018-05-07_USCOURTS-insd-1_18-cv-01267_DAVIS v. US PRESIDENTIAL TASK FORCE.pdf": [
    [
      4.0490946769714355,
      3.291802167892456,
      -0.9455028176307678
    ],
    "Gene Thomas Davis filed a lawsuit against the U.S. Presidential Task Force, claiming that a criminally implanted Artificial Intelligence (AI) device in his body was eavesdropping on his conversations. The court found that Davis's allegations lacked subject-matter jurisdiction and deemed his claims implausible and frivolous, ultimately dismissing the case for lack of jurisdiction. The ruling emphasized that the court cannot entertain claims that are completely devoid of merit."
  ],
  "2024-01-30_USCOURTS-ca2-22-02057_Park v. Kim.pdf": [
    [
      5.577814102172852,
      3.4276351928710938,
      0.1526554375886917
    ],
    "In the case of Park v. Kim, the United States Court of Appeals for the Second Circuit affirmed the dismissal of Minhye Park's lawsuit against David Dennis Kim due to her persistent failure to comply with court orders pertaining to discovery, constituting willful noncompliance. Furthermore, the court addressed the conduct of Park's attorney, Jae S. Lee, who admitted to citing a non-existent state court decision generated by the AI tool ChatGPT in her briefs, failing to adhere to the professional responsibilities expected of counsel. The court referred Attorney Lee to the Grievance Panel for her misconduct and mandated her to provide a translated copy of the ruling to her client."
  ],
  "2025-04-30_USCOURTS-ctd-3_25-cv-00544_Moales v. Land Rover Cherry Hill et al.pdf": [
    [
      5.176368236541748,
      3.6674752235412598,
      -1.1315054893493652
    ],
    "In the case of Moales v. Land Rover Cherry Hill, the plaintiff Kasaun Moales filed a pro se complaint alleging that a credit application he submitted to a car dealership constituted a 'credit contract' that was improperly handled. The U.S. District Court for the District of Connecticut dismissed the complaint due to lack of subject matter jurisdiction, finding that neither federal question nor diversity jurisdiction applied. The court noted that Moales's claims were rooted in state law and did not present substantial questions of federal law. Additionally, concerns were raised about the accuracy of legal citations in Moales's submissions, suggesting that he may have relied on artificial intelligence to draft them, which led to misstatements about legal precedents."
  ],
  "2024-12-31_USCOURTS-mad-1_24-cv-12093_Olivier v. Military Intelligence et al.pdf": [
    [
      4.7723283767700195,
      3.3742220401763916,
      -1.31231689453125
    ],
    "Herve Olivier, Jr. filed a complaint against several defendants, including government and intelligence agencies, while claiming violations of his rights during his incarceration in Massachusetts. The court dismissed the complaint, emphasizing that it lacked a legal basis and specific factual allegations, particularly regarding the conditions of confinement and claims related to artificial intelligence. The court found the allegations of harm related to AI, such as 'brain hacking,' to be conclusory and unsupported by fact."
  ],
  "2024-02-01_USCOURTS-txwd-1_23-cv-01149_Fredrick v. Artificial Intelligence Fields.pdf": [
    [
      5.055404186248779,
      3.3500068187713623,
      -1.674193024635315
    ],
    "In the case of Darion Dion Frederick v. Artificial Intelligence Fields, the plaintiff sought to proceed in forma pauperis due to indigency, which was granted by the court. However, the court found Frederick's complaint to be frivolous and lacking merit, as it alleged emotional and physical distress caused by 'alien friends from other planets' and claimed emotional traumatization linked to artificial intelligence. The magistrate judge recommended the dismissal of the case with prejudice under 28 U.S.C. § 1915(e)(2)(B), as the allegations failed to state a valid claim and were deemed implausible, thus lacking a basis for federal jurisdiction."
  ],
  "2024-06-21_USCOURTS-txwd-1_23-cv-01149_Fredrick v. Artificial Intelligence Fields.pdf": [
    [
      5.540997505187988,
      3.7069642543792725,
      -1.2557790279388428
    ],
    "In the case of Fredrick v. Artificial Intelligence Fields, the plaintiff, Darion Dion Frederick, filed a complaint against the defendant related to artificial intelligence. The United States District Court for the Western District of Texas reviewed the magistrate judge's report and recommendation, which concluded that Frederick's complaint lacked merit. As Frederick did not file any objections to the recommendations, the court accepted them and dismissed the complaint without prejudice. The case centered around issues involving AI, although specific details of the claims were not provided in the summary."
  ]
}