{
  "total_cases": 277,
  "plaintiff_types": {
    "individual": 91,
    "investor(s)": 26,
    "platform(s)": 3,
    "class-action": 25,
    "corporation(s)": 93,
    "u.s. federal securities regulator": 1,
    "government entity": 16,
    "religious organization": 1,
    "ai-focused startup and associated plaintiffs": 1,
    "individual with publisher": 1,
    "u.s. federal consumer protection and competition enforcement agency": 1,
    "": 8,
    "finance company": 1,
    "u.s. federal regulatory agency": 1,
    "ai technology startup developing proprietary artificial intelligence systems": 1,
    "nonprofit organization": 3,
    "associations and institutions of higher education": 1,
    "artificial intelligence startup developing ai technology and related trade secrets": 1,
    "hotel owners and operators franchised under the oyo brand": 1,
    "real estate brokerage and services partnership asserting trademark rights": 1
  },
  "defendant_types": {
    "corporation(s)": 184,
    "platform(s)": 22,
    "individual": 33,
    "government entity": 20,
    "mixed": 1,
    "finance company": 2,
    "private university and associated institutional defendants": 1,
    "investment entities offering purported ai-driven forex trading services": 1,
    "public school district": 1,
    "law enforcement technology and body-worn camera manufacturer and provider": 1,
    "hotel franchisor providing ai-based revenue management and booking technology to franchisees": 1,
    "class-action": 1,
    "": 3,
    "public university implementing remote exam proctoring with virtual room scans": 1,
    "competing software providers accused of copying plaintiff’s lottery tracking system (lts) software": 1,
    "public university": 1,
    "competing honor society and online membership organization": 1,
    "automotive manufacturers and distributors accused of infringing the asserted patent": 1,
    "investor(s)": 1
  },
  "tech_types": {
    "generative ai": 34,
    "enterprise ai": 22,
    "computer vision ai": 16,
    "medical ai": 6,
    "ai bots": 15,
    "Anaconda’s AI technology software referenced in the Anaconda Agreements, used for AI-related computing and software development.": 1,
    "Proprietary artificial intelligence and machine learning technology developed by NVIDIA, including source code and technical materials for machine learning models and AI systems, whose confidential handling and protection are governed by the stipulated protective order.": 1,
    "ai patent / ip": 17,
    "AI algorithim to monitor ad viability": 1,
    "Plaintiffs allege that Meta Platforms, Inc. used integrated artificial intelligence and machine learning models within its social advertising platform to optimize, manage, and control ad distribution and pricing, and that these AI/ML systems were part of Meta’s anticompetitive strategy to maintain dominance and inflate advertising prices in the social advertising market.": 1,
    "The case involves an alleged securities fraud scheme in which John Clayton sought to bring an artificial intelligence (AI) company public through a reverse merger, but the specific AI technology or system used by that company is not described in the opinion.": 1,
    "automated calling systems": 8,
    "Workday, Inc.’s AI-based applicant recommendation and screening system used in hiring processes, which allegedly relies on automated algorithms to evaluate job applications and recommend or filter candidates, and is claimed to cause disparate impact against applicants over forty (as well as by race and disability).": 1,
    "ai trade secrets": 9,
    "ai proctoring": 1,
    "decision": 17,
    "Statewide electronic voting infrastructure, including Dominion ballot marking devices (BMDs), election management software, and electronic pollbooks used to record, process, and tabulate votes and maintain voter information.": 1,
    "The summary notes that SHIVA is referenced as engaging in diverse technological fields, including AI, but it did not play any role in the legal issues of this case.": 1,
    "transcription ai": 4,
    "face recognition": 25,
    "ai legal research": 1,
    "digitized AI financial transaction system": 1,
    "Cloud-based AI services platform marketed for public-sector data analysis.": 1,
    "Automated data collection and sharing systems embedded in the Flo Period and Ovulation Tracker mobile app, including software development kits (SDKs) that algorithmically processed and transmitted users’ menstrual and pregnancy data to Meta Platforms and Google for analytics and advertising purposes.": 1,
    "recommendation": 8,
    "The case involves Restoration Robotics, Inc.’s ARTAS System, a robotic hair transplantation technology that uses automated/robotic capabilities to assist in hair restoration procedures. The alleged misstatements concern the functionality, marketing, and sales strategy of this robotic system as described in the IPO offering materials.": 1,
    "data transformation and data processing": 1,
    "autonomous/vehicle ai": 2,
    "HP Inc.’s “Workforce Experience Platform” software, which uses AI and automated systems for data insights and analytics, and WEX Inc.’s services, which also use AI for data insights and analytics in a different business domain.": 1,
    "Defendants allegedly misrepresented that their self-study programs and business opportunities used artificial intelligence (AI) to maximize customers’ revenues, when such AI capabilities were not as claimed.": 1,
    "": 18,
    "cybersecurity": 4,
    "AI-based software developed in a research collaboration between Google and the University of Chicago to analyze anonymized patient medical data and predict healthcare needs.": 1,
    "Automation tools, including artificial intelligence (AI), allegedly used to promote and operate misleading income-generating schemes and to make deceptive earnings claims about AI-powered business opportunities.": 1,
    "AI-driven e-commerce business tools and services marketed as \"Automators AI\" that purported to automate or optimize online business operations and earnings.": 1,
    "Defendants allegedly claimed to use artificial intelligence tools to select profitable e-commerce products and automate aspects of an online business opportunity, representing that AI technology would identify winning products and generate substantial earnings for consumers.": 1,
    "AI-enhanced predictive weather modeling system that combines 3-D storm simulations with radar and observational data to reconstruct and analyze storm events.": 1,
    "\"Dr. Mo\" predictive analytics / AI-related software licensed by Soft10, Inc. and used and sublicensed by Findability Sciences, Inc.": 1,
    "A machine learning software solution VoterLabs, Inc. was developing and claimed to be working on in connection with its engagement for Ethos Group Consulting Services, LLC; the dispute involves how funds and development efforts for this AI/machine learning software were used and represented.": 1,
    "AI-driven clean energy storage and management systems offered by Stem, Inc., which use artificial intelligence to optimize energy storage and usage.": 1,
    "Integration of artificial intelligence with drone technology in connection with the F2 Carbon boat design for Martac Corp.": 1,
    "Vicor Corporation’s business and stock movements were tied to contracts and developments involving AI computing platforms, but no specific AI model or system was identified beyond general references to AI-related hardware for AI platforms.": 1,
    "Business ventures and cryptocurrency schemes that used commission-based marketing plans and platforms with AI components, including companies like Thrive99X that incorporated AI-related features in their operations.": 1,
    "One defendant, Groma GPS-Turkey, designs software using artificial intelligence for vehicle automation.": 1,
    "Loop AI Labs Inc.’s proprietary artificial intelligence technology and related trade-secret AI systems developed by the startup, which are alleged to have been misappropriated by the former CEO and others.": 1,
    "AI products and services marketed by GoldenSpear and its subsidiary AI Health, including AI technology for fashion and healthcare applications that were allegedly misrepresented to investors and banks.": 1,
    "The case concerns General Services Administration evaluation of “leading-edge technology (LET)” projects, which included artificial intelligence among other advanced technology areas, but no specific AI system, model, or product is identified or technically described beyond that categorical reference.": 1,
    "AI solutions for law enforcement developed and offered by GovernmentGPT Inc., involving advanced technology that could be used for surveillance and analysis in law enforcement contexts.": 1,
    "AI-driven revenue management and booking software used to manage pricing and reservations for OYO-franchised hotels, marketed as increasing hotel business and revenue.": 1,
    "An AI-based system for diagnosing and solving computer system issues, including saving the state of a computer system when a solution to a detected problem cannot be determined.": 1,
    "Stem, Inc. operates AI-driven clean energy solutions, using artificial intelligence to optimize clean energy storage and management as part of its business operations referenced in the merger and investor communications at issue.": 1,
    "NVIDIA’s proprietary technology related to artificial intelligence and machine learning, including non-public machine learning models, algorithm specifications, and associated source code used in its products and services.": 1,
    "Lytx’s DriveCam system using machine vision and artificial intelligence (MV+AI) to monitor drivers and predict distracted driving behaviors by analyzing video and related data.": 1,
    "Plaintiff alleges that VIPKid and related entities fraudulently used his and other teachers’ digital likenesses, images, and recorded teaching sessions to develop artificial intelligence technology, including AI-driven educational or tutoring systems that simulate or replace live teachers.": 1,
    "quintus": 5,
    "Defendants represented to investors that they used \"artificial intelligence-based high-frequency trading models\" to trade securities and generate returns, though the SEC alleges these AI-based trading models were part of a fraudulent Ponzi scheme solicitation.": 1,
    "Transportation Security Administration’s Advanced Imaging Technology (AIT) scanners using Automatic Target Recognition (ATR) software to algorithmically detect anomalies on passengers’ bodies during airport security screening.": 1,
    "Automated software ‘bots’ used by the Ashley Madison website to mimic real user profiles and interactions with customers.": 1,
    "Computerized Measures of Academic Progress (MAP) standardized testing system, which delivers questions via computer and provides an on-screen calculator for certain math items.": 1,
    "Meta’s automated, algorithmic advertising tools on Facebook, including systems powered by artificial intelligence that help create, target, and distribute ads and dynamically generate or place scam advertisements using Dr. Forrest’s likeness.": 1,
    "Artificial intelligence technology developed by Loop AI Labs Inc., including its AI-based methods, algorithms, and related trade secret technology for AI applications.": 1,
    "AI technology developed by Loop AI Labs Inc.; specific type of AI system not described in the summary beyond being startup AI technology.": 1,
    "AI/ML (artificial intelligence and machine learning) technologies and solutions proposed by PredictiveIQ LLC under the Air Force Small Business Innovation Research (SBIR) Program’s Commercial Solutions Opening (CSO), involving fast-evolving AI/ML capabilities for defense-related applications.": 1,
    "Plaintiff alleged that the U.S. Department of Defense stole his intellectual property related to artificial intelligence; the filings reference AI-related inventions/creations, but no specific AI model or system name is described in the summary.": 1,
    "Recruitment software developed by Toolbox for HR that uses artificial intelligence to identify technology professionals who are likely to change jobs, supporting the \"CV Timeline\" domain and related services.": 1,
    "AI-driven software testing and quality assurance technology developed and used by Appdiff, Inc., and related AI technology from PinkLion, an AI company acquired by Appdiff.": 1,
    "References to emerging technologies, including artificial intelligence and machine learning, as part of the professional and technology services sought under CBP’s Blanket Purchase Agreements; AI/ML are discussed as capabilities in offerors’ proposals and as technologies CBP aims to integrate, not as a specific, identified AI product or model.": 1,
    "ai algorithim": 1,
    "Spider Labs’ advertised AI-based technology for detecting online advertising fraud, whose effectiveness and truthfulness were questioned by John Doe in anonymous online comments.": 1,
    "Plaintiff alleged contributions to the fields of Artificial Intelligence (AI), Information Security, and Legacy Information Systems (LIS), claiming the United States infringed his rights by using his AI-related scientific ideas and principles, but no specific AI system or model was identified.": 1,
    "Artificial intelligence mechanisms allegedly used within video games to optimize and reinforce addictive gameplay through feedback loops, reward systems, and pay-to-win features aimed at increasing engagement and playtime, particularly for minors and young adults.": 1,
    "Augustus Intelligence, Inc. was a company aiming to develop AI solutions, but the specific AI technologies or models it used are not described in the summary.": 1,
    "Proprietary artificial intelligence software applications and related technology developed by Next IT Corporation, including confidential methods and systems for AI-based applications.": 1,
    "Pinterest committed in the settlement to use artificial intelligence tools to help ensure diverse and inclusive content representation on its platform as part of its diversity and inclusion reforms.": 1,
    "Plaintiff alleges defendants used artificial intelligence and other technologies to harass her and to sell her identity online, but no specific AI product, model, or system is identified.": 1,
    "Plaintiff alleged the United States used his research in artificial intelligence and information security without compensation, but the opinion does not identify any specific AI system, model, or technology beyond this general reference to his AI-related research.": 1,
    "Prisma Labs’ mobile application that uses artificial intelligence to transform user photos into artwork-style images.": 1,
    "Plaintiff alleged misuse of artificial intelligence (AI) products by various high-tech companies in connection with purported antitrust violations and monopolistic practices, but no specific AI technology, model, or system was identified or described in detail.": 1,
    "Plaintiff’s scientific work allegedly concerned Information Security, Artificial Intelligence (AI), and Legacy Information Systems (LIS), but the opinion does not identify any specific AI model, system, or deployed technology—only general references to AI-related research and ideas.": 1,
    "Meta Platforms Inc.’s AI technology allegedly used to intercept, analyze, and monetize the plaintiff’s electronic communications between 2015 and 2021.": 1,
    "An AI painting application used on a mobile phone to generate pornographic images, including potentially minor-depicting content, based on user-provided search criteria.": 1,
    "Alleged algorithmic hiring and resume-screening tools used in recruitment that purportedly discriminated against women with employment gaps.": 1,
    "Spider Labs’ AI-based technology and related business practices that were allegedly criticized as ineffective or misrepresented by the anonymous online speaker.": 1
  }
}